[{"term": "Emily", "definition": "A girl with the name Emily can be very shy at first, but she doesn't show it. Once an Emily gets to know you some, she may get a little crazy. Emily is usually artistic with some form of artistic talent. Emily's have the most gorgeous eyes that you can get lost in. This girl is usually romantic and falls in love easily. She is very smart and a big procrastinator. Emily's are very soft on the inside, but they don't let their emotions show to just anybody. They usually hide their emotions for fear of affecting other people's happiness. Emily's are great and loyal friends and they can cheer anybody up. Emily's are good at telling what mood people are in just after a few minutes, so don't try to hide your emotions from them. If you know an Emily, I suggest you confined in her as a friend, as she WILL keep all secrets you share private, and she will never let you down. Emily's are good problem solvers and are very flexible with schedules.", "x": 0.8014935851097107, "y": -49.85271072387695}, {"term": "Hannah", "definition": "Hannah is kind, shy, talented, and beautiful, but she won't open up to anyone until she fully trusts them. At first she seems quiet, but once you get to know her you see a completely different side of her. She is loving, graceful and kindhearted. She tends to mask her emotions, so she smiles even when she's broken inside. If you happen to see her smile it will brighten up your day. Hannah is the sweetest girl you will ever meet, so if you do meet a Hannah, never let her go.", "x": -1.1428189277648926, "y": -47.90251541137695}, {"term": "Alexis", "definition": "Alexis is the most gorgeous girl but doesn't believe she is. She is insecure about her body, and worries about how people look at her. She is full of love but can't find the right guy. she is understanding, funny, and caring. She had been threw alot do she knows alot of good advice and on top of that she is usually right. She is kind but can easily be upset. She likes to feel important and be told she is beautiful when she thinks it's not true. She is great in bed once you get her there. She has a beautiful smile but hates it. She likes to party and have a good life. She can be shy but when she knows you she will love you and make you drool. An Alexis is a very good cuddle buddy. Once you have an Alexis never let her go because she may but come back.", "x": 5.70697546005249, "y": 14.13638687133789}, {"term": "Sarah", "definition": "Sarah is a lovely girl, who will always stay by your side. Sometimes she can be weird, awkward or even emo!! But everyone knows she is the perfect friend, she spreads happiness everywhere she goes and can't help to put a smile on everyone's face! Overall she is the nicest girl ever and no one could imagine their lives without her!!", "x": 16.20389175415039, "y": -21.588939666748047}, {"term": "Samantha", "definition": "The most beautiful girl in the world. She is trustworthy , kind, gorgeous and makes the best friend. She is so compassionate of others feelings and would never do anything to hurt others She is drop-dead gorgeous, but not conceited. She usually has long brown silky hair and big beautiful warm brown eyes. Her looks match her personality....she is so magnetic!  She is in great shape and always put together perfectly! She is so compassionate to others and always tries to make someone smile. She is a genuinely sweet girl who never talks bad about anyone. Anyone who speaks bad of a Samantha is usually just jealous of her because she has everything they want but don't have!  Samantha's are extremely confident and can stand on their own. They light up a room by simply walking in. They always make others feel good. They are immune to negativity so haters, don't waste your energy on Samantha...her self-esteem will always outshine you!  Samantha's are highly intelligent and will accomplish so much in life! They will be very successful in anything they do. That is because they have priorities in life and know what's important. They put education first, because that is what makes you a better person.  Samantha's make the best friends, girlfriends and family! If you're friends with a Samantha in life ,you should consider yourself very very lucky. Samantha is the sweetest kindest and most beautiful person you will ever know.", "x": 19.820655822753906, "y": -9.387779235839844}, {"term": "Ashley", "definition": "Ashley was the name of my daughter. She was fierce and amazing. She always fired back and stuck to her statement. Smart, a goal setter, and a high achiever. She cared about others before herself, and was always willing to help a friend. She was loved by all, and comfortable with being herself. She cared about family and fighting for what's right. She died of a disease later when she was 14. We had an inside joke about her havig an Urban Dictionary definition. This is in memory of her.", "x": -10.437050819396973, "y": -40.66157150268555}, {"term": "Madison", "definition": "Many people think Madison are perfect but they aren't half of the time. The may put a smile on their face everyday but they are usually dying inside. Madison usually go by their nicknames Maddie, maddi, maddy. They think they are ugly and hate when people call them pretty, cute, hot, beautiful. Madison's are usually funny and will always be there for anyone they care about. They'll never stab you in the back and be fake. Madison's are most commonly very athletic and love to eat food, (mainly healthy foods such as strawberrys,) Madison's have been through a lot and tend to hide how they are feeling by putting a smile and faking being happy. They lie that they are okay and only tell a certain few. If your one of those few your very lucky and should be pround cause you earned their trust. Their trust can be very hard to gain because of what they have been through.", "x": 6.653561592102051, "y": -10.710467338562012}, {"term": "Taylor", "definition": "She can be an amazing outgoing person. Really shy, but once you get to know her, she is really crazy! She is very self conscious about herself, so watch out! She can be really funny, crazy, amazing, weird, etc. She has beautiful eyes! If you meet a Taylor, don't let her go! She can fall in love very easily. She is a very forgiving person and very trustworthy. She can be the most laziest person at times, but she is very active. She is very beautiful, but remember NEVER call her ugly, she will believe anything you say. She will be in denial if you call her pretty, but in her head she would be going crazy. Never let a Taylor go cause once she's gone, she never comes back.", "x": 4.781722545623779, "y": -44.42955017089844}, {"term": "Jessica", "definition": "The most supportive and loving girl that walks this earth. She has beautiful eyes that sparkle even at night. Her smile can light up a whole room filled with darkness. And her laugh is contagious and cute. Boys can't help but to stare. If she falls in love, she won't stop thinking about you. She is intelligent, athletic, into art, and great at listening. If you ever find yourself a Jessica, don't let go.", "x": -21.69322967529297, "y": 1.2044250965118408}, {"term": "Elizabeth", "definition": "The most beautiful spectacular, gorgeous, cute, incredible, breathtaking, wonderful, pretty, adorable, and most importantly cutifulazing girl ever.There isn't a person in the world that doesn't enjoy talking to her. she is nice yet very honest. She will tell it like it is. Very inellegent and active. She takes every word she says into great thought. She Makes everyone laugh but sometimes they are laughing at her. She is very careful with her actions but approaches them in a careless manner. She is extermely talented. Loves her close friends and family so much she would lay her life down for them. And when she sets her mind to something there is no going back. She is confident in her skin and has self respect for herself which makes guys admire her even more. She would never let a guy get in the way of her education. She is strong and able to live with no man. She is headstrong, and good with tools. As for guys they all love her but none have the courage to ask her out. she always sets her mind on one guy and that one guy only and she will stop at nothing to make her hers. She is sucessful in anything she does and does it with pride. in the end she is a beautiful, smart, sweet, determined girl that everyone is friends with.", "x": -11.799748420715332, "y": -33.24714660644531}, {"term": "Alyssa", "definition": "Alyssa is a gorgeous girl who doesn't realize how amazing and beautiful she is.\r She is the type of person you would want to have as a best friend. She is outgoing, fun, beautiful, and she knows how to cheer someone up. She is the type of person who puts others before her even when they don't deserve it. Alyssa is one of those amazing people that you would meet and would never want to lose. If you come across a best friend named Alyssa, well then your in luck! She has two sides to her. She can be the most graceful and loyal girl you could ever meet, then in a split second she can go all gangster on you and rap battle you to ever lil Wayne or Tupac song. She is someone you cannot lose", "x": -33.91307067871094, "y": -22.423097610473633}, {"term": "Lauren", "definition": "A Lauren is someone who is extremely beautiful inside and out. She always puts others before herself even if it causes her stress. When she's upset she doesn't want people to know because she feels powerless and she's a strong person. She is caring and compassionate but she doesn't take crap from anyone. She's not afraid to dance in the street but she can be calm and quiet when she wants to. When people talk to her they can't help but smile because she's a very positive person. When i see sunshine I think of a Lauren. She really is just a big ball of sunshine. She's not confident about herself and she's generally very self conscious. She's not quick to trust anyone but she's also not quick to judge. A Lauren is the kind of person you want to keep in your life forever because she really can brighten your darkest days. If you are blessed enough to have a Lauren in your life never let her go.", "x": -43.91719055175781, "y": -19.274635314941406}, {"term": "Kayla", "definition": "A gorgeous young lady who is really goofy but everyone loves her. She has a way of making you happy when your sad and also when you doubt yourself. Boys love her if you have a girlfriend named Kayla shes a keeper. She is nice and very thoughtful. She will always be a friend when you need one BUT if you make her mad or sad she does have a bad side and you do not want to get on it. Sometime Kayla can be annoying at some point but she is always by your side :)", "x": 13.864206314086914, "y": -27.321523666381836}, {"term": "Brianna", "definition": "The best girl in the world. Being the best friend you could ever have, and a hopeless romantic, she is the most amazing person to have in your life. If you are sad, or have a problem, she will give you the best advice on how she would solve, or fix, said problem. Very honest and straight forward, but she is the best person to ask for an opinion. Usually loves her boyfriend, friends and family. She usually dates guys named Chris, Zack or John. When she is with a guy she is loyal, and does not cheat, she loves them with her heart. Brianna's usually tend to have red or dark brown hair and brown eyes! Once you get to know Brianna she really knows how to make awkward silences go away and be the loudest in the room, but also has a nice soft side. She is an amazing, loyal, outgoing, GORGEOUS, different, and the list goes on and on about how wonderul and great she is. She isn't fake. If she doesn't like you, she doesn't like you and she won't be fake to you or talk about you, unless you have something to say. But when she likes you, she loves and gives all of the respect you deserve. She is really fun to be with. She is sooo funny, aswell! :PP I lovee this girl, Brianna, and if you don't know a Brianna, meet one! You are missing out on a great and wonderful and BEAUTIFUL girl.(:", "x": 23.67184829711914, "y": -3.131707191467285}, {"term": "Megan", "definition": "Megan. Not Meghan. Or Meagan.  She hates when people spell her name wrong.  Megan means \"Pearl\" or \"Child of Light\"  A Megan is a good friend to all who take the time to get to know her. She is very creative. A Megan is never shy, and loves doing things with her friends and family.  Most Megans also have a dark side and many secrets. She will give really good advice because she's been through alot. Once a Megan trusts you, do NOT betray that trust because she isn't going to wait for karma to get you, she'll just get you herself...  She isn't scared of anybody and the only thing she truly fears is losing somebody she loves.  Most Megans are born during the winter or spring.  Megans can be really stubborn at times, and know how to get what they want.  Usually, Megans are beautiful inside and out, but they don't know it or can't see it. They tend to look down on themselves Alot. It's not a good quality but at least most Megans are not stuck up.  In a relationship, a Megan will do whatever it takes to keep her mate happy and take care of them. She prefers a long term relationship over short term and doesn't like to waste her time. Megans are INCREDIBLE lovers.  If you are lucky enough to know a Megan, hold on to her. She is very special and deserves the best. Treat her right.", "x": 10.568264961242676, "y": -39.47696304321289}, {"term": "Victoria", "definition": "Victoria is kind, caring, sweet, talented, never faltering in the friendship she so freely gives. You are a very lucky person to know a Victoria. Do not take her for granted, she can be fragile, she deserves to be treated with care and respect. Victoria's often do not see their own talent, and need to be reminded of it often, in time, they may even grow to see it in themselves, if their talent is nurtured and cared for. Victoria's are remarkable people, they seem so close to perfect it is almost scary, people may question if they even deserve the friendship they are given, do not fret, friendship will not be given to those whom are unworthy, not often at least. Victoria's are usually good judges of character, although they do make mistakes every now and again, it is just one of the factors reminding those around them that yes, this perfect angle is human, even if she does seem heaven sent.", "x": -33.19200897216797, "y": -24.839656829833984}, {"term": "Emma", "definition": "An artistic, independent minded girl. She doesn't need anyone but herself to help her on her way. She is wild, fun, and a great friend. She can be stubborn, and won't stop an argument until she has made her point, but she is also forgiving and loyal. She is the bravest of her friends, often a daredevil. She won't be into the mainstream things in society, but make herself her own style.", "x": -15.399026870727539, "y": -39.1121940612793}, {"term": "Abigail", "definition": "A Best Friend who understand everything about everyone, the most amazing person you'll ever come across, beautiful funny, talented, clever. Gets on with everyone yet chooses to have the weirdest people as best friends because deep down she is a insane crazy child! Secretly has alot of problems that she doesnt want anyone to know but ends up telling some one or another because her best friend knows her too well. She is very strong and would rather see others happy than be happy herself. Happiest when singing or acting and playing the piano. And All Round Amazing Person...", "x": -4.932502269744873, "y": -25.588266372680664}, {"term": "Rachel", "definition": "Rachel will never fail to surprise you. Often she'll say something random and continue on like nothing happened. If you ask her to repeat it, she'll pretend she doesn't know what you're talking about. She's the loudest person you'll ever meet. No matter where you are, you can hear her. She loves to talk, she never stops. She's nice, but she could also kick your ass. She won't take shit from anyone and she speaks her mind. She's so blunt it may be considered rude. If you break her trust, she'll hold it against you forever. Her friends love her, but pretend like they don't know why. Her friends do what she wants because no one can win an argument against her. Rachel will often softly punch her friends when they are making fun of her, then yell when anyone tries to punch her back. She's very funny and sarcastic. She has an inappropriate sense of humor. Her mind is so far in the gutter, it is the gutter. She is very charismatic and easily coerces people into doing things for her. She loves food, and will take it from anyone. She eats like a maniac but she never gains a single pound. She is likely the skinniest person you know. She loves to complain, even when there's nothing to complain about. She will never share a secret that you've told her without permission. She's very attractive, and most of her male friends have had a crush on her at one point. Most are too scared to ask her out, because she can be intimidating. She flirts with everyone she's around, but isn't aware of it.", "x": -12.259098052978516, "y": -36.93134689331055}, {"term": "Olivia", "definition": "An amazing girl! She's trustworthy, pretty, intelligent, kind, and hilarious. I'm so lucky to have her in my life.\r She's a beautiful girl with an amazing body. She's charismatic, sophisticated and powerful. But she can also be very weird and crazy.\r Laughs at her own jokes.\r She's incredibly smart, has a way with words and is a great listener. She loves helping people with their personal problems.  She doesn't take shit. She's gonna catch your shit and throw it back at your face. Do NOT get in her bad side. She doesn't like being surrounded by many people, so if you're close to her, she considers you very special.  She's pretty tall with adorable hands and the cutest feet!\r She's the kind of person who eats a whole pizza by herself and not gain weight. Like, what?\r She doesn't like olives, unless they're in her martini.  She's a very special girl.  An elegant name for an elegant girl.\r You're lucky if you know an olivia. She's ana amazing friend, and an amazing lover. Very passionate and romantic. Unless you get on her bad side.\r She can be shy and sophisticated, but can also be SO badass.  She's extremely talented and artsy. Very good at sports as well.\r She truly has it all. Looks, brains, personality. If you know an Olivia, cherish her.", "x": -12.212233543395996, "y": -34.652793884277344}, {"term": "Jennifer", "definition": "Friendship, Jennifer is loyal to the bone. Would do anything for a friend she has allowed into her very small, sacred, circle of trust. Once youve received her friendship in return youll find the best most loyal true friend one could ever have.\r Love, Jennifer doesnt love easy. But when she does,she loves fiercely. Loyal to her man 100%, won't bat an eye at another man once shes given her heart. Shes a smart nice girl on the streets but naughty in the sheets. Shes passionate, not only in the bed, but everything in her life.\r Whatever she loves shes is beyond ridiculously passionate about. Her passion shines through every thought she speaks.\r Shes mysterious. Everyone wants to know who she is but cant figure it out.  Which leads to envious enemies. Jennifer is easily envied and attracts enemies due to jealousy. People feel intimidated within seconds of meeting her. Shes insanely beautiful. Shes smart. Shes creative. Shes funny without even trying. She carries herself with certainty of who she is. Yet shes not snobby. People feel below her based on their own insecurities and will lie about her to take her off the pedestal they themselves put her on.\r She has a heart of gold yet very few people know this about her as she doesn't let people into her life.\r She will be the best mother. She will honor her kids once she has them. She would die for her children. She will be number one in her childrens eyes.\r Everyone needs a jennifer in their life", "x": 28.749042510986328, "y": 37.697174072265625}, {"term": "Amanda", "definition": "Amanda- meaning worthy of love in latin. amazingly beautful, but she dosent know it. she has a wonderful personality but thinks differently. around friends she is vary outgoing. but in crouds and around people she dosent know she is vary shy. she is vary emotional. you will be lucky to have her as a friend for she is vary loyal and trustworthy. you are ether on her good side or on her bad side. there are few peolpe she dosent like. but she can make there lives hell if she wants to. she trys to help everybody, and will give you any advice she can if you need it. she will tell you things you need to hear, and it dosent matter if you wanna hear it or not. she has many admirers but dosent know it. if your lucky enugh to be with her, dont screw it up. the feeling she has for anybody will last no matter what. but theres no telling when they will fade. she loves with all her heart. dont loose her.", "x": -2.7455525398254395, "y": -23.143905639648438}, {"term": "Sydney", "definition": "sydney is generally a beautiful, nice, spontaneous girl. she is usually quiet and shy, but around her friends she is outgoing. friends go to her for advice, because she knows what she is talking about. when you compliment her, she is always flattered, but doesn't see it in herself. she is beautiful, and if you tell her that, it will mean so much to her. she is a great friend, and an even better girlfriend, who will give a guy all the time in the world. if you have her, never let her go. sydneys are crazy, wild creatures, but are truly amazing. Her eyes are a mesmerizing olive-green, and they turn grey in the winter. she has passion for arts and music, and is in fact brilliant, though she may not show it. if you and a sydney are friends, you can trust her because she will not betray you. she has a guilty conscience, so she will always try to keep everyone happy. Her body is perfect, curvy rather than anorexic-skinny, yet her personality is even more perfect. She likes holding hands, cuddling, eating food like a regular human, and mismatched socks. When she likes a guy, don't be surprised that she doesn't go for the popular ones. Her fashion sense is unique, like her personality. Her faults are singing too loud and being clumsy. Don't betray the trust of her, though. She gives second chances, but isn't stupid and naive. Be kind to her, like she is to you. Sydney is the most spontaneous girl you will ever know, and she is not one you should take for granted.", "x": -1.7205344438552856, "y": -24.832658767700195}, {"term": "Morgan", "definition": "A person who is beautiful, but they never believe it themselves. They are caring and always there for their friends, and always trying to solve everyone else's problems. They can be lazy, but love being involved. They are often depressed when teased, left alone, if they feel used, ignored by the people they love, or left alone. They tend to be energetic and love being outside, and are very intelligent. They love to read, draw, or anything creative. When they are put in a situation where they meet new people or are doing something new they can be shy and quiet until they know someone or what they are doing. If they are with their friends than they can be loud and obnoxious. They are musically inclined and they love to Sing. They can act like parents to everyone, especially those they love. They get hurt easily and need lots of attention from their love. They love being around animals and have a special touch with them. They are trustworthy and person you can turn to for advice or just for an ear. they can be violent and don't forget anything that happens, but have a hard time holding grudges.tend to be really spiritual,don't like to talk about their feelings, but love to tell stories about past adventures.they're always smiling,if quiet than something is wrong.often will mess with their hair color and style, love messing with colors,outfits and shopping.they love learning new things,especially different languages.They aren't great spellers though,and don't like lying", "x": -0.0986892506480217, "y": -25.7364559173584}, {"term": "Nicole", "definition": "she is a selfless person who is very outgoing. she doesn't care what other people think of her and she is a great friend. she has her bitchy moments but she will fix it. she doesn't care about being the most popular, she sticks with her close friends and makes new friends easily. she is the bestest best friend", "x": -4.273898124694824, "y": -21.96392059326172}, {"term": "Jasmine", "definition": "Jasmine is amazing. She is beautiful, stunning, sweet and kind girl that could make anyone in the world happy to just be around her. With a Jasmine, you will feel like you can say anything to her, and never be judged for it. She will make you feel happy in every way possible. Jasmine is one of the best friends you could ever ask for, and if you have one, don't ever let her go. You may often feel jealous of her due to her looks and fun nature. Her advice makes you want to get down on your knees and beg for more, as it always seems to help in every situation, no matter what. Overall, to have a Jasmine in your life could be one of the best things you could ever have, and you should always treasure that gift.", "x": 21.76009178161621, "y": -5.9660868644714355}, {"term": "Grace", "definition": "A extremely beautiful and lovable girl who is very talented and intellegent. She is very musical and has a great singing voice, but Grace sometimes lacks self-confidence and doesn't believe that she can achieve what she wants to, she can. Grace is a brilliant listener and gives great advice for friendship or boy problems! But she needs someone to listen to her and give her advice. If you have a Grace you are very lucky , use her wisely, encourage her and give her advice as she needs someone to listen to her once in a while !", "x": -31.113027572631836, "y": -27.291311264038086}, {"term": "Destiny", "definition": "A name that is easy and fun to say. A person who you can talk to for years and never get bored of! The most beautiful girl ever, who can put up with your crap even if she doesn't deserve it. A girl who you will love from day one, and never ever stop because there is no way you can picture life without her. She makes you so happy you can't even begin to explain. Someone who makes you wait a full day to get a tbh, but it's probably the best and most sweetest thing you can see. She is the kind of girl who loves unconditionally and has been put through way to much heart break. Destiny is not a girl you should toy with. Because she honestly shouldn't be put through it, she is too nice for you to be a dick to her. She should come before your xbox or ps3 and not after, you can pause your game she is more important. All in all though she is who you love most of all, and even though you cant tell her that enough, or think she understands, she really does. Destiny is the best girl that you will ever meet and if you are lucky enough to date her, you know she isn't just your 'girlfriend' she is your bestfriend and you would do anything to make her laugh.", "x": -16.293413162231445, "y": -16.4190616607666}, {"term": "Anna", "definition": "Anna..........literally the best girl in the world. She is a very adorable, amazing, stubborn person. She has amazing humor and can brighten your day with just her smile. But there's also her bad side; you mess with her and you'll end up in hell.\r Anna is also probably the best person to date. If you get an Anna in a relationship, she will give all her effort, and will most likely get very attached to you; that is if she likes you enough, ´cause with the one, she gets ¨click¨ with, shes most likely in it for the long run. Anna´s also very sexy, tho she doesn't try to dress too nice, but either way, she'll take your breath away. She has all the right curves in all the right places and has sparkling eyes that just melt you away. Shes literally a goddess. She is also an amazing friend, probably the best friend in the group. So if you ever DO get her in a relationship, NEVER let her go, EVER!!! NO MATTER WHAT. When you have her heart, take care of your ¨Anna¨ cause shes only a once in a lifetime thing. Anna is the love of my life, my whole world, and if I lost her.....I´d LITERALLY kill myself!", "x": -18.443607330322266, "y": -24.40167999267578}, {"term": "Julia", "definition": "A Julia is the sweetest person you'll ever meet. She's so kind and understanding. While she may be quiet And reserved, she is so funny in her own way. She's so clever and beautiful, and will ALWAYS be there for you no matter what. She can be a bit over-trusting and this can be a disadvantage for her. She may sometimes be so involved in the wellness of others that she forgets to take care of herself; this is her fatal flaw.  She loves to do all kinds of sports like volleyball, soccer, gymnastics, and even swimming. She's got so much energy and such a great heart that she attracts so many people to be her friend. She's very loyal to a small group of friends, 3 people or so, and they're just like sisters. They've been through everything together and will continue to do just that.  She's so smart and academically gifted, regardless of what she may say to be humble. She loves to draw, paint, and sketch on her homework.. this might sometime get her in trouble but the teachers don't mind her. They know she's such a sweet, kind, generous, and wonderful person.  Julia's are typically petite, gentle-looking people with great, big, beautiful eyes. They constantly criticize themselves, but no one else can see the flaws she adamantly insists to be present. She doesn't have to try and dress up to look good, because she looks go no matter what.", "x": -37.40260314941406, "y": -22.755653381347656}, {"term": "Haley", "definition": "An amazingly beautiful girl who can take your breath away with just a flip of her long brown hair. Short, but what she lacks in height she makes up for in a personality that is impossible to resist. If you fall for her, you think about her every moment that she's away from you. An excellent cuddler, and very ticklish. A beautiful body, with great hips. Haleys don't take shit from anyone. Someone who can be completely oblivious to what's around her. If you catch her, don't ever let her go. You can stare into her eyes and feel that flutter in you're chest that makes your breath stop short. She is the kind of girl you have to approach, if she likes you, she might not tell you, so you have to say something before its too late and she moves on. Once you lose your chance with her, its gone. So catch her, and keep her, because she's perfect.", "x": 1.4350221157073975, "y": -43.74702835083008}, {"term": "Alexandra", "definition": "Usually a girl's name. She's one of the strongest people you'll ever meet. She is the most patient and caring person you could ever meet. She deserves more than she has, so spoil her. She is the most beautiful person you'll ever meet. She is worth every second of your time, and you'll never regret staying up all night with her. She'll change your life, making it the best you could want it to be. She can make you smile just by smiling herself. You'll disagree at times, but you'll both apologize the next day. You could talk for days about how amazing she is. When you don't see them for a while you may go insane. Once you get to know her, you'll feel protective of her. She is not a snobby person, and never will be. She is nice to people who deserve it. She has random bi-polar moments that make her that much better. You could talk to her for hours about anything with her. One way or another, she finds a way to keep you out of trouble. She will always say something negative about her appearance even though she always looks beautiful. Always remind her she is beautiful. IN the worst of times she will be happy. She won't admit at first, but she is like every other person and has problems, and just needs someone to talk to. You just have to be there for her. You will never be able to describe her because there is so much to talk about. If you ever meet an Alex(andra), keep her close. She's is worth everything. You'll want to be with her forever.", "x": -17.64291000366211, "y": -16.040950775146484}, {"term": "Kaitlyn", "definition": "️Kaitlyn is a girl who always loved to make you laugh, she tends to be quiet when in public, but when she's with her friends she goes crazy! She's a real good person to hang out with, she tends to lack self confidence, but always tries to bring other people confidence up before her. When she has a crush on a boy, you can tell. She'll blush whenever she's talking with you and is quieter than usual. She'll put her hair behind her ear, and will only confess when she feels it's safe. ️Kaitlyn is artistic, and a great artist, loves nature and will probably end up living in the country. ️Kaitlyn also has a bad side, when you piss her off she'll let you know not to do it again. She can be a bit of a bitch at times, sometimes a hypocrite, and lies at times. But she's a big jokester and will laugh with her friends until their belly hurts and you have to pee.  ️Kaitlyn is definitely a keeper!", "x": 7.701699256896973, "y": -29.898113250732422}, {"term": "Natalie", "definition": "she has the sweetest heart, shes shy at first but once you get to know her you wouldnt regret meeting her. ANY GUY would be the luckiest guy in the universe to have her. shes funny, sweet, nice, kind, and beautiful. she has everything anyone would want in a girl. Natalie will be supportive of you no matter what the lengths are and will always try to guide you in the right direction. At times Natalie May seem rude but there is no other person that will care for you like she does. she is great with friends, know a lot of people but is very anti social, her bestfriends are the most important thing to her. she seems shy, innocent, and quiet at first, but being around her will make you feel like you're problems fade away. There isn't anyone like her. The way she looks at you when you aren't looking. The way she will talk about you will make you feel like you've won it all. With Natalie she will make you feel like you will never be alone. She will talk to you all the time. Make fun of you. Laugh with you. But most importantly she will love you like there is no other in the world. Never take her for granted she only would want to see you thrive. She's been hurt so many times but still loves and cares for people like there's no tomorrow. She has a heart of gold.  Natalie is the true definition of love", "x": 14.876614570617676, "y": -25.06351661682129}, {"term": "Brittany", "definition": "Best girl in the world! She's selfish for one person and she hates people who touch him/her. She can be an angel or the devil. Overall the bestest girlfriend ever. She cares for you, she loves you, she can be popular. You would be blessed to have her as your friend. She's the most beautiful girl you would ever meet. This is Brittany.", "x": 13.464908599853516, "y": -49.03718185424805}, {"term": "Katherine", "definition": "A wonderful girl with the heart of gold. She is an angel but claims not to be perfect. She loves to party with her friends. Nothing will stop her from smiling and enjoying her time with the people she enjoys to be around. She is caring and will always help the ones who require it. She can forgive her enemies but never forget what they did. Katherine laughs about little things but it's good because her smile is her best feature. Katherine will be the love of your life the moment you lay eyes on her. But don't try to be cocky or a fuck boy when you are near her, or she will cutt you off quickly. Katherine is very passionate and loving when it comes to someone she loves. She shows much romance and affection and expects the sake back. She will write long paragraphs and scenarios of how much she loves her mate. It's hard to be Katherine's lover because of the amount of times she has been used and hurt for her appearance and not what's on her inside. But when you do get a chance to be with her, always remember to keep her happy! It's what she deserves! she will devote her heart and her life to the one she loves! That's just how perfect she is!", "x": 22.555757522583008, "y": -21.166845321655273}, {"term": "Stephanie", "definition": "Stephanie is a very beautiful girl that at first seems really sweet and innocent but once you get to know her is very fun and crazy to be around. She is very unique and the best friend you could ever ask for. She always has your back and will always be there for you no matter what. Make sure you never lose a stephanie because she is very rare and valuable there is no one else like her because she is amazing.", "x": -18.736570358276367, "y": -29.017990112304688}, {"term": "Rebecca", "definition": "Rebecca is the name reserved only for the genuine and best women on earth. They are REALLY cute, beautiful, very smart, driven, have a wonderful and playful personality, and has this cute awkwardness about them. They are fun-loving, adventurous, silly, and always suspicious of everyone. Rebecca has the most amazing eyes ever. She always makes people laugh & her ass is the size of Jupiter. It's hard to get close to a Rebecca at first because they choose their friends wisely and are very untrustworthy to everyone around them. This is a good thing though because if they talk to you, they really mean everything they say and are very straightfoward about their feelings towards someone.  Rebeccas severely underestimate everything about themselves, so you need to constantly prove to them that they are much better than they think. They also can dance and sing and they will do anything they set their mind to(except driving).  It's impossible to be actually mad at a rebecca, no matter what they do, because they are so loveable :)  Rebeccas can be confusing sometimes and they can make people go crazy sometimes, but in the end, it turns out everything they do that makes you go crazy just makes you like them just that much more. They're much more than meets the eye.\r Never lose doubt of Rebecca, they don't lie, they are one in a million. Just because they don't hug you doesn't mean they hate you(I hope) =)", "x": 6.298163414001465, "y": -46.225486755371094}, {"term": "Maria", "definition": "Maria is talented, gorgeous and defiantly stands out of the crowd. Her eyes will hypnotize any man that looks at them. you'll find many other girls jealous of her beauty which will often land her in the middle of a scandal. Every girl want to be her, and every man wants to have her. She keeps her friends close and her enemies closer. She has a small group of really close friends and loves them all. She's not fake. Even though sometimes she can be a bit mean when she speaks her mind, she always has the best at heart. She's a big flirt and that can sometimes get her in trouble. Her body resembles one of a greek goddess. She looks like a real life disney princess. Her skin glows in the sun and her smile can brighten up the whole universe. When she walks in a room, heads turn, she has everyone hypnotized with her gorgeousness . She loves the attention and always tries to be the best form of herself. All boys want her, but she has her eyes set on one person. She's a passionate lover. Be careful, cause once she lays eyes on you your under her spell. Maria will haunt your dreams and will stay in your mind forever. she's addictive. But don't play games with her because she'll see right through. She knows her self worth and is not afraid to tell you. She is hard to get and might break your heart by rejecting you, but don't give up because she loves when men are persistent for her and don't easily give up. You wont regret it once you kiss her. Never let go of Maria.", "x": 21.779930114746094, "y": -41.31062316894531}, {"term": "Allison", "definition": "A gorgeous girl who doesn't know how beautiful she is.  She's shy, but once you get to know her, you'll be glad you did.  Has her own style.  Is just herself, and won't change anything about herself for anyone else.\r She is nearly impossible; she can't ever make up her mind.  All the boys that know her, fall for her.....hard.  And when she falls, she falls hard, and has a tough time getting back up.  Some one who cares about everyone else before herself, even though she's the one who needs the most help.  Has been through a hell of a lot, but brushes herself off and puts on a smile every day:)  Some one YOU should get to know", "x": 2.695253849029541, "y": -41.938655853271484}, {"term": "Amber", "definition": "The best girl you will have on your side. Don't ever lose her cause then you will soon lose yourself, She will leave you in awe and just plain amazement. one of the most cutest girl's you will ever meet, knows how to treat a person as who they are and gets to know you and how you are. Do her wrong and it will mess you up and leave you thinking about what you have done.", "x": -17.3187313079834, "y": -26.35932731628418}, {"term": "Savannah", "definition": "The most kindest and sweetest girl you will ever meet. She may be quiet at first but once you get to know her she will be the craziest and funnest person you've ever met. Usually a brunette but can also be a blonde. If you ever need advice talk to Savannah, she has the best advice. If you ever meet a Savannah be sure to say hi because you won't regret it. Oh and did I mention Savannah's make good girlfriends. :)", "x": -3.038987636566162, "y": -48.082462310791016}, {"term": "Danielle", "definition": "Danielle  Danielle is the most amazing girl you'll ever meet, she has an incredible smile that will light a room and always knows what to say when you're feeling down. She may not think she's perfect but she is perfect and truly amazing and anyone would be lucky to have her in their life. She knows how to make everyone laugh and when your with her you'll always have a good time. She is truly the life of any party and without her everything would seem a little less brighter.", "x": 10.626667976379395, "y": -17.91227912902832}, {"term": "Courtney", "definition": "A courtney will do almost anything for a friend. She is amazing and beautiful and has the highest goals. She loves to laugh and has the most amazing eyes. Shes artistic and has the voice of an angel. She has no dancing skills but when it comes to making people laugh shes got a 100 out of 10 ability. She is super nice and friendly so never be nervous when approaching a courtney but if you mess or hurt any of her friends you better be ready to feel her wrath. She gives awesome advice about everything you can ask but is most likely not the best with comebacks. She tries her best to keep everyone happy and can keep secretes under lock forever. She is trustworthy and kind and will never try to purposely hurt you. She is hyper and often called cute or adorable but has very bad luck with boys. Her mind often shuts down when talking to the opposite sex and she falls in love very easily. She is very quiet but once you get to know her she is a fire cracker of life. Once she sets her mind to something it is done. She is unique and loved by all. She has many opinions and is always thinking. She is a once in a lifetime girl who can never be labeled. Never think bad of a Courtney because she will most likely be the one to change your life forever.", "x": 23.206689834594727, "y": -23.213857650756836}, {"term": "Mary", "definition": "Mary is a kind, caring, beautiful, stunning, and amazing girl that everyone has to fall in love with. She is committed to one guy only, and is very faithful. She is the best girl you'll ever have the pleasure of meeting in your life. Every time she enters the room suddenly you are filled with joy, and she is always able to put a giant smile on your face. She makes you feel at home, loved, and like there's no one else but you. She gets excited about everything, which brightens up your day, everyday. She likes to go on adventures and to make great memories and have fun! She loves to skate, to draw, to cuddle, watch ROM coms, eat strawberries, make forts, drink lemonade, be carried around, and be nice to every one. Despite how much she's been through, she's still the strongest and most amazing girl you'll ever meet. She is perfect in every way, but once you date a Mary, never let her go, because her perfect imperfections cannot be given up. She is an unforgettable girl, and not to mention hot! She is the best girl you'll ever meet in your life, and time stops every time you see her, because she is just so beautiful, and everything a guy could ever ask for.", "x": -24.15131187438965, "y": -7.227986812591553}, {"term": "Gabrielle", "definition": "She is kind, yet strong. She is sensitive she is hurt by people ,but instintly forgives them. She falls in love hard and gives it her all when she does.She can crack jokes to break silence ,but know when to be serious. She loves everyone and can care for you she is the best kind of person.", "x": -37.412574768066406, "y": -13.590023040771484}, {"term": "Brooke", "definition": "Brains, beauty, athleticism, talent, sense of humor, the biggest heart ever--a Brooke has it all. She's the sweetest girl you'll ever meet, who never hesitates to do the right thing and who always has a smile on her face. She's ambitious and aspires high, but she'll always be there for you if you need someone to lean on. Brooke's the girl in the back desk, with her head bent over her notebook as she scribbles down notes, but she's also the girl no guy in his right mind can keep his eyes off of, the girl sprinting across the finish line to the screams of her fans, the girl who stops in the middle of a crowded hallway to help you pick up your dropped books, and the girl who can always find something to laugh about. She'll get straight A's, no sweat, and she's always around to help you out if you need it. She's fragile, and can be easily hurt, but it's easy to make her laugh as well. A Brooke is somewhat shy, so she'll fly under your radar if you're looking for the type of girl who throws herself at you screaming, but once you see her, you'll be glad you did. Every girl wants to be her friend, and every guy wants to have her at his side. Known for her huge heart, as well as her beauty, she's the type of girl who'll be faithful to you through all the ups and downs. A Brooke is hands down the most amazing person you will ever meet! If you find a Brooke, hold on to her because you'll regret it if you lose her!", "x": -17.91684341430664, "y": -0.7818484306335449}, {"term": "Sierra", "definition": "A girl who has Good Vibes. She thinks she's super ugly but actually really pretty. She can sometimes have really bad depression but hide it really well. They have a past that no one really knows. They have really good taste in fashion, but have a different style then most. Most people like her. If guys like her they'll keep it a secret and reject that they do. She also doesn't think she can sing but people tell her other wise. She stands up for what she believes in and defends people. They have a smile that lights up the room and really pretty eyes. She doesn't date a lot. If she likes you its obvious. She can get made fun of sometimes. If she has a problem she isn't going to tell anyone. At party's she's the life of it. She loves to dance.", "x": 2.8498964309692383, "y": -13.995137214660645}, {"term": "Sara", "definition": "Outrageously gorgeous. Sara's personality is like no other. Her features are exotic and stunning, her smile and laugh light up a room. Sara is self conscious and dislikes many things about her body. Sara is very hard on herself, but she can't help it. Everyone except herself knows she's an out right bombshell. Boys are afraid of her, they think she is out of their league. But Sara feels alone, because few guys have the courage to talk to a girl that amazing.  Sara can at times be a sarcastic diva, but only when she has good reason.  She is so kind to everyone. She'll always be there when you need her, even if you've hurt her, she will always care even though you once didn't. Sara will make you laugh, but she doesn't think she's funny.\r Sara's been through the worst hardships. But you wouldn't know, she doesn't like to burden others with her troubles.  Sara waits for the right man. And if it's you daym you're a lucky guy, she'll be the best thing that will ever happen to you. Sara is shy at first. Only because she's scared she'll get hurt. She's been hurt too many times in the past. But when she opens up to you, you'll never want to let her go. Sara is sweet and innocent, but take her out and you will be amazed. Fun and sexy, you would never guess Sara has a bit of dirty mind. She is adventurous if you know what I mean, but is still the classiest gal you could find.  Bottom line if you ever find a Sara, cherish her, you'll never find one like her again.", "x": 20.100065231323242, "y": -39.635929107666016}, {"term": "Kimberly", "definition": "She is shy at first but once you get to meet her she is one crazy motherfucker . She is kind, funny,and just amazing to be friends with. She is the only person you would want to be with at any time. Kimberly will cheer you up if you are sad. If you mess with Kimberly she would kill you.", "x": 18.11243438720703, "y": -24.06968116760254}, {"term": "Mackenzie", "definition": "A beautiful girl who has overcome much in her life and is wise beyond her years. She is very calm in difficult situations, similar to Dumbledore. She is a great friend because she always knows what to say, will comfort you, cry with you, laugh with you, and play with you. She has eyes like no other and a smile that will light up the room. She is funny, crazy, and witty, social, very athletic and talented. She is someone you will want to keep around and love for a very long time.", "x": 8.08905029296875, "y": -20.61705780029297}, {"term": "Sophia", "definition": "Sophia. There's so much to say, but so little space to say it in. I'll start from top to bottom. Her hair, the most beautiful you'll ever see on anyone, and like her personality, its been dyed all colors of the rainbow. Each and everyone of the colors representing a sweet portion of her perfect soul. Her eyes, brown would be too dull of a word to represent the hazel beauty that are her eyes, but, that's only half the whole picture. You couldn't miss the hints of green mixed in, like a chocolate jungle, with a river you can float in forever. Mouth. No not like that. I'm talkin about those cute, cute lips, mesmerizing, like you could kiss them til the end of time and beyond and that still wouldn't be enough time to truly cherish them. That voice though, ohh, that voice. We'll just say that angels would be jealous to have a good of a voice even as close to hers. That body, so fine, so so so fine, anybody would fall in love with even a glance, and what she could do with that gorgeous body, that's for a special someone ;). She'll say this and that about it being bleh, but if she could see what 𝐚𝐧𝐲𝐛𝐨𝐝𝐲 else saw, she'd be giving herself the love that she truly deserves. Sophia, without a doubt, is the embodiment of everything good in this world jam packed into the body of a goddess. Anybody, and I mean anybody that has her in their arms, counts as the luckiest guy on this Earth, without a doubt, and Sophia, I'm lucky as helllll, to have you in my arms. Thank you.", "x": -21.3314151763916, "y": -15.898486137390137}, {"term": "Hailey", "definition": "Hailey is outgoing, fun, and gorgeous. She is defiantly one of the most beautiful girls that you will ever know. She is very friendly, caring, and sweet. She can also be witty and funny. She is daring, but has common sense and knows her limits.\r She is fairly quiet, but once you get to know her, she is loud, funny, witty, and outgoing. Hailey likes to joke around and have fun. She will lighten up your day, no matter what kind of mood you are in. If she likes you, she LOVES you. If you get on her nevres or annoy her, she HATES you. Be careful with Hailey. She is tough, but insecure, sometimes. She is gorgeous on the inside and out. If you are blessed enough to have a Hailey in your life, never, ever, EVER, let her go. <3", "x": -15.843833923339844, "y": -35.70073318481445}, {"term": "Katelyn", "definition": "Katelyn is an all out amazing girl. She truly cares about all of her family and friends. If she says I love you she means it. Katelyn is hot,smart,talented, has a pretty smile. Sadly can't say the same thing about her laugh😂. Katelyn seems like a very shy person but once you get to know her you will know she's the complete opposite of being shy. She is not afraid of anyone. She is confident. And she wouldn't give three fucks if you didn't like her chances are she would tell you \"I don't like\". She doesn't like to be wrong in any way she will argue and argue till you see her point. But if your like her you can eventually convince her she's wrong. She's extremely shy with the guy she likes. But any guy would be lucky to have her. Katelyn is an all out amazing,beautiful,smart, and talented girl. And if you have a Katelyn in your life then your lucky.", "x": -9.688409805297852, "y": -34.16981506347656}, {"term": "Michelle", "definition": "A beautiful name for a (young) beautiful girl. She is outgoing, very funny (or tries to be), and has a unique style. She is also very lovable, but can be awkward at times. She is the type of person you can easily get along with. She will be there to comfort her friends when they need it. She has a gift of discernment, meaning she knows when something is up. She has a great voice, but is shy to show it to the world. She needs more confident. Also, she can be very hyper at times. Even with her flaws, she is still perfect because the amount of flaws she has cannot compare to her flawlessness.", "x": -6.034582138061523, "y": -31.868871688842773}, {"term": "Vanessa", "definition": "Vanessa: A girl who is overlooked by others, someone who is very special but is much too often taken for granted. An amazing girl who is incredibly beautiful on the inside and out. A person who is extremely sensitive, even in a comfortable environment. Although very friendly and sociable, Vanessa can be shy and apprehensive. A person who comes once in a lifetime, that will change who you are as a person forever. Someone who you should never let go, if you do you will regret it. She loves to sing, eat, and laugh. Her soulmate will be someone that shes had a past with and came back in her life, Vanessa is described as a simple word such as beauty.", "x": -1.041527509689331, "y": -40.84868240356445}, {"term": "Erin", "definition": "Erin's are the most adorable people you will ever meet. They have a smile that will light up the room and will always laugh at everything even if it isn't funny. She crazy and hella weird, but a good weird. They tend to have brown hair and brown eyes. A killer body, and a funny sense of humour. But Erin's tend to have a really bad self esteem and always worry about what others think of herself. She often hinds her sadness with her big smile and laugh. She's such a polite girl who will always look out for her family and friends, she will always put others before herself. If you ever meet a Erin, remind her everyday that she is amazing, because they are. They are very creative and absolutely love food, they will eat your house out of food. I'm not exaggerating, I'm being serious. Honestly the sweetest person you'll ever meet. Erin's neutral faces always look angry and mean, but when seeing her eyes light up and when she smiles, it's something else. Befriend a Erin!", "x": 20.98602294921875, "y": -26.895902633666992}, {"term": "Andrea", "definition": "Andrea can be shy and quiet but then she will make you laugh every single second she is very precious and is a very {beautiful} girl She's the most {humble , loving and , caring person you can ever find you can do her wrong so many times and she will always be there for you helping you out giving you the best she can , even when she's going through many things herself she will make you the {happiest} , she doesn't know how beautiful she is , she has the most {gorgeous} {eyes}that you'll just get lost in they will make you fall Inlove so easily , her smile is the prettiest that it's so contagious that smile is surely unforgettable. she likes being away from any thing that does not include good and has the most amazing personality ever her soul and mind are just full of unsaid thoughts and emotions shes very trustworthy and loyal .she's very {different} just unique from any other girl keep in mind she's someone you won't want to lose she's just special . Andrea is a {independent} girl she can't fall Inlove easily unless you've really got her heart but with or without you she will be {successful} in everything that she has {passion} for .she is a hard worker and can do it with or without anyone . She has an amazing body aswell she's just {stunning} inside and out everything about her will make you go crazy. Her {imperfections} make her {perfect} . She's a {little nerd} she has everything planned out before time , but sometimes she can't choose she's very {picky} at times.", "x": -36.08060073852539, "y": -21.95494842529297}, {"term": "Isabella", "definition": "Isabella is that type of person that will always be there for you. She is truly beautiful inside and out. Her personality is beyond perfect. She can be mean and rude at most times, but nice and sweet the rest of the times. She is very funny. When your around Isabella, you'll never be frowning. She's always laughing and smiling. You'll never find her truly sad or mad. Her looks are just perfect. She has that look in her eyes that makes you feel comfortable. She is very pretty. Her laugh makes you smile. She isn't a huge dude magnet, but many fall head over heels for her. If you ever meet her, never let her go.", "x": 9.2816743850708, "y": 22.624067306518555}, {"term": "Jenna", "definition": "Originated from Danish Gods.\r Has the power to heal the broken with a smile or the sound of the soft genuine voice thats like your favorite song.\r She love adventure making music that plays to the soul.\r Jenna can make a normal day amazing with just a word or two.", "x": -19.253625869750977, "y": 4.99337911605835}, {"term": "Shelby", "definition": "Shelby is unlike any other. She also goes by the name Shelbster. She is perfect in every way, she's the best in the world but she doesn't think so. Be cautious with this. Know what she really wants or needs and be yourself. She'll know when you're joking and that you do love her and that everything is real. Let her know how you feel and don't overdo anything. When you're with her you cannot speak right and it's as if no one else exists. You won't know where to start when you try to tell her how much she means to you so you end up just squishing her as hard as you can. Be careful when squishing her because it can and will leave bruises or rib pain. Speaking of pain, learn to ice skate so you won't make her fall and feel horrible after. When you're with her you both feel a soul warming sensation. She'll always be on your mind and knows how to brighten the worst days with her amazing smile, which in turn makes you smile all day every day. She'll always make you the happiest you've ever been. She belongs in an exhibit because it's crazy not to be staring at her. Visit a doctor prior to seeing her, your heart will explode due to tachycardia otherwise. Make sure to know Arabic because she will tell you something very important in that language. While you're at it, learn Spanish. She is someone you will be around forever. You won't ever lose her. You will always be in love with her and miss her and it will always be mutual with her. She is the beyond the most important in the world.", "x": 11.316447257995605, "y": -41.75439453125}, {"term": "Chloe", "definition": "Chloe is the most amazing person that you will ever meet. If she tells you her secrets you know that you are something special. She is the sweetest and nicest girl that guy could ever imagine. On the days that you are down she is the one person that will make you feel better. If you are lonely you can think of her and suddenly you are not as lonely. She is the best girlfriend a man could ever wish for, sweet, caring, and always knows adzactly what u want. If a man had a girlfriend like Chloe they would be the luckiest person in the world. She is always willing to do anything. She is a risk taker, and a care taker. She uses her mind in the best way possible. She is a very brillient women with many talents. She is very athletic and caring. She creates a love that can only be expressed by feelings, it is so strong it is hard to put into words. She is the reason why some people can sleep peacefully at night and get up in the morning. She has a great personality and the most beautiful smile that you have ever seen. Her face is irresistible and hard not to look at. Chloe is the type of person that will comfort you when you are going through a hard situation. She is always by your side, extremely forgiving and will never hold a grudge. She can keep a secret, you could trust your life on her and never have a worry that she will tell anyone. Overall Chloe is the brightest best and most beautiful person that I have ever see.", "x": 11.774085998535156, "y": 15.590263366699219}, {"term": "Melissa", "definition": "Melissa is a loyal friend who is someone you can talk to about anything. Melissa also likes to keep her emotions to herself because she doesn't want others to worry about her . She will care for you through thick and thin so don't hurt her. Melissa is also a loyal girlfriend . She loves adventures and people being themselves. She can care for people really quickly but she gets hurt if they just push her away . You will be lucky to have a Melissa.", "x": 8.94239330291748, "y": -37.70542907714844}, {"term": "Bailey", "definition": "A girl that has all of the qualities that any guy could ever ask for, consists of a beautiful face, a nice personality, a cute laugh, and gorgeous in general. A Bailey is also the best person to talk to if you are having an issue or just need someone to listen to you. Usually gives a guy Rapid Heartbeat as a sign of a true Bailey and true Baileys are hard to find, very unique.", "x": 11.755300521850586, "y": 35.188167572021484}, {"term": "Makayla", "definition": "Makayla's are usually very quiet girls at first but once you earn their trust, get ready for a good time. They are kind, sweet and sassy all at the same time, making for an awesome combination. Makayla's aren't afraid to take risks and have fun but they have enough self respect to not post they're plans all over social media. They are cooler than the flip side of your pillow, incredibly pretty and fiercely loyal friends. If you're lucky enough to meet a Makayla, get ready for the time of your life.", "x": 11.85623550415039, "y": -30.036205291748047}, {"term": "Paige", "definition": "A girl who is pretty, but doesnt think it. She sometimes lacks in the confidence department and has some rough days. She's funny and smiles a lot. She won't tolerate being called \"hot\" or \"sexy\" by a boy. A guy who says that doesn't have a chance. She has loads of friends and has her sassy moments. She loves music and can't dance, but does anyway. Paige has been through a lot and hates when people are negative towards her. She's amazing, but doesnt know it. Get to know her and she'll be less awkward.", "x": 18.93027687072754, "y": -37.95945739746094}, {"term": "Mariah", "definition": "Mariah is a very intelligent, loving, caring, passionate,at times an introvert, and at other times very outgoing. Mariah is very creative, whether it be in drawing, writing, graphic designing, or singing. Oh and can be very bi-polar at times. Often an Aries. Hands are like lethal weapons when you get on their bad side. Very independent.", "x": 21.17677879333496, "y": -43.68529510498047}, {"term": "Kaylee", "definition": "A Kaylee is a sassy, classy, beautiful, intelligent female. People who befriend Kaylees become better just for having met her. Her awesomeness is contagious and her smile is infectious. Kaylees are all that other woman hope to be. They are usually very accomplished and well rounded, good singers, dancers and writers. They are creative and assertive; unafraid to fight for what they want.", "x": 14.547545433044434, "y": -16.858230590820312}, {"term": "Madeline", "definition": "A girl who acts shy in front of adults but crazy with her friends. She defends anything she loves. She is very protective of her friends, and sometimes can act a bit mature, but will be silly instantly.\r She isn't one to follow the crowd, and likes to stick out with her friends.\r Madeline usually loves music, and gets excited over little things.\r She doesn't like it much when her name is pronounced wrong, but doesn't speak up most of the time to tell hem wrong. She usually goes by the nickname Maddie, Maddy, or Madi.", "x": 4.796536445617676, "y": -10.21465015411377}, {"term": "Caroline", "definition": "The sweetest, most caring girl you will ever meet. If she says she loves you, she means it from the bottom of her heart and will do absolutely do anything for you. She will do whatever to make you happy, even though if it means she's getting hurt in the end. She is the greatest friend you could ever have, she's there when you need her and will never hesitate to go out of her way for you. Her eyes are beyond beautiful, and tell you every emotion that's going through her head. She's fragile though, known to break down easily even though she rarely shows it. She has beauty and brains. Love her and she will love you back. However, if you mess with her in any way, she will make sure you get it back twice as bad. She is rarely ever a bitch unless you give her a good reason to be. If you have one in your life, she is special and unique, don't let her go. She's one to hold onto.", "x": -38.39896774291992, "y": -14.380810737609863}, {"term": "Kelsey", "definition": "The most beautiful and remarkable girl you will ever meet. She is funny, has a great personality, and is always fun to be around. She epitomizes all the love songs you hear on the radio. She will light up your world and if you have a shot go for it because you will never regret it. The greatest person you will ever meet. CAUTION if you get to know her you will fall for her.", "x": 24.317028045654297, "y": 16.814136505126953}, {"term": "Marissa", "definition": "A beautiful person inside and out a great friend and someone you want to be around all the time she will have a beautiful smile and attract you like metal to a magnet she will be your biggest crush but will never be available and if you are lucky enough to catch a Marissa never let her go.", "x": -23.12886619567871, "y": -5.9726104736328125}, {"term": "Breanna", "definition": "One of the best people you can meet. Completely awesome, but can be very shy at times. Beautiful on a level on her own, but doesn't realize it. She cares about her friends and will do a lot of things to make them happy. Is very passionate and can talk to you for hours on end if something Intrests her. Over all just one of the most amazing people in the world.", "x": -4.449695587158203, "y": -30.53133201599121}, {"term": "Christina", "definition": "She's the most kindest, gentle person you will ever meet. She will go out of her way to making anybody happy even if the aren't her favorite person in the world. She's so focused on keeping everybody happy she's the one that really needs all the up bringing. She may say shes OKbut on the inside she's secretly dying. So help her out of that dark void she's going through.", "x": -42.23762512207031, "y": -17.318761825561523}, {"term": "Faith", "definition": "A stunningly gorgeous cute all around girl, with a dazzlind smile, and hypnotic eyes this girl will win anyone she wants to over. Her laugh is contageous. Faith is very competative and loves to win. Faith is very confident and ready fo any and everything. faith is very modest and hates when people brag. Faith tries to be nice even though sometimes peole get all her nerves. Anyone who knows a Faith might kow that she can be agressive when she is ticked. but overall she is amazing and should be treasured.", "x": -14.598124504089355, "y": -32.75736999511719}, {"term": "Autumn", "definition": "Autumns are usually really smart and pretty. She comes of shy at first but when u get to know her she's the funniest person you'll ever meet. She's really unique and has her own style and way. She doesn't care what people think and is very independent. She's always smiling. She makes a room so much brighter with her smile. She usually really pretty and has a good body and glowing face.(most common freckles and rosy red cheeks.) she's amazing and so awesome. Find you a autumn and don't lose her because she will be the best thing in your life.", "x": 8.948039054870605, "y": 23.78423500061035}, {"term": "Kiara", "definition": "A beautiful girl with a gorgeous personality (funny, kind, sweet etc) She is everything u want in a Friend, BestFriend and Girlfriend. Kiara is such a lovely person & will always cheer u up when you're sad and she always makes u laugh. She is very chill & she would be the coolest person once u meet her, she makes many friends and everyone has to LOVE being around her. altho it seems like she has a hard personality, she is very emotionally fragile as she wears her heart on her sleeves & trusts too many people that she ends up getting hurt. She always try to be kind and to help others as much as she can but she is very energetic along with lazy. She gives the best advice ever so u should always go to her for help, in whatever situation she will be there. Even tho she is a sweet hearted person she also doesn't care and let's life throw anything at her, always looking for fun, Kiara tends to get in trouble for taking chances and trying new things since she is very adventurous and dare devil-y, she always stands up for what she believes in & she is not afraid to put up a fight. Be careful tho, break her and she will never let it go, she may forgive u but she will NEVER let it go. She is also very pretty, smart and intelligent, and the one thing u HAVE to love about her, is her smile, her slime lights up the room & u just want to start smiling. She is shy at first and weird but she's just a perfect imperfect person.\r {also to mention she has a really nice booty🍑}", "x": 16.7624568939209, "y": -23.841289520263672}, {"term": "Jacqueline", "definition": "1. The name of a girl who is beautiful, strong, and intelligent. One who is easy to fall in love with but impossible to let go. She is funny, exciting, and enthusiastic. Jacqueline has an amazing personality that appeals to every person fortunate enough to meet her. Her eyes are captivating, her smile, intoxicating, and her heart lights the darkest, coldest souls and fills them with happiness. She is down to earth And carefree. This name is given to beautiful woman. She is a drop dead gorgeous girl. If you meet one don't let her go!  2. Another word for perfection.  3. God's most precious and wonderful angel.", "x": -20.588220596313477, "y": 2.177375078201294}, {"term": "Tiffany", "definition": "The girl that will always be laughing. You never get tired of it. Her laugh is not that slutty kind, but the voice that is true and meaningful. You think about that jewelry store when you hear her name, but she IS a jewel. She'll always be there. But you can't grab a Tiffany and make her yours because she is special. Perfect in every way, but hard to get, just like a jewel.", "x": -23.927915573120117, "y": 1.0843007564544678}, {"term": "Laura", "definition": "Laura is the type of person to say fuck it and do it, she loves living on the edge and creating adventurous memories. She's a strong beautiful girl and no one quite knows what she's been through, she is a smart, keen, determined individual, destined to make a change in the world. A Laura is an hilarious girl and has the personality of a comedian, she has much confidence but lacks patience and her moody outlet being blunt just adds to her personality. She's a forgiving kind person willing to make people smile even if she's having a bad day, she wants so be somebody, an individual, like no one else. She does not care whether people like her or love her, she just is herself and no one can change that. She's a real keeper for a friend and will create the best memories with you", "x": -17.769094467163086, "y": -37.25495529174805}, {"term": "Briana", "definition": "The name Briana means strength. Briana's do not even know that they are beautiful, that is also why they don't have to wear makeup. Totally awesome, very random, adventurous, smart yet uber gullible at times. They have fiery personalities and more importantly fabulously fantastic music tastes. Can be hard on the outside, but beauty and love are under that. Intelligent, talented, kind, very giving, outgoing girls who love to smile, and that smile attracts heaps of guys. Brianas are suckers for love and fall in love easy. They like all junk food especially cookies and cake. They are great friends who love their friends back. They are always there for you, no matter what and love you for who you are. They hate to disappoint people and are super funny while they always look at the bright sides if things. If you know a Briana give her a hug, she is amazing.", "x": 3.6753270626068115, "y": 31.813251495361328}, {"term": "Alexandria", "definition": "Beautiful and Intelligent girl loves some sports but not all. Has lots of friends has beautiful hair. Doesn't get jealous very easily, looks for the best in everything doesn't have a bitchy attitude the most beautiful person you will ever lay eyes on every guy wants her but if she already has one then he knows never to let her go I would love to be a Alexandria", "x": 14.431849479675293, "y": 0.918631374835968}, {"term": "Cheyenne", "definition": "Can be quite shy until she is comfortable with someone, then she will be very outgoing. She normally keeps herself to herself, and she doesn't like talking about personal things. But when she gets close to someone she will open up to them and hope that they will understand. Cheyenne's are good looking and are not normally very girly. She doesn't like being the center on attention and prefers to help others rather than herself. Anyone around her feels automatically better because she can be such a happy person, although a lot may go on that no one knows about. They like listening to music and reading and are intelligent and creative. She picks carefully who she is friends with, the people she accepts are important to her and they feel the same way.  Cheyenne may make mistakes but she will try her best to make them right afterwards and make sure that they are never accidentally done again. She may get paranoid that her friends don't like her and they have to reassure her that they don't, although it doesn't annoy them because they understand.", "x": 6.529585838317871, "y": -29.851682662963867}, {"term": "Mikayla", "definition": "A girl who always has your back. Mikayla's have a natural love of animals and people. They are very feisty and have a wonderful body shape. They often don't they are beautiful even if their friends tell them everyday. A Mikayla will spend up to eleven hours outside with animals and friends. If you don't see a Mikayla with her friends, animals, or outside she is probably inside on her phone, tablet, or PS3 playing games or on youtube. If a Mikayla doesn't get her way, watch out.", "x": 24.089689254760742, "y": -41.06538772583008}, {"term": "Claire", "definition": "An extremely intelligent person with an amazingly awkward sense of humor. They love to be complimented. They know that they are talented and smart, but they don't like to admit it. They are usually introverts but are very loud, social, and obnoxious with people they know very well. They usually watch a lot of tv and read a lot of books and often make obscure references bases off of these things. They have a lot of inside jokes. They usually have many friends but it's hard for them to find a \"best friend\" for very long. When they get a crush on a guy, it will last for a very long time before they eventually give it up.", "x": -11.703032493591309, "y": -25.343387603759766}, {"term": "Cassandra", "definition": "Cassandra is known for always telling the truth. Also known as a Greek princess. Modern day Cassandra's physically are extremely attractive with long hair, great bodies, the best personalities and to top it off an amazing rack. Every Cassandra you meet is a blessing in your life, Don't ever take her for granted because you will regret it, she is the best thing that will ever happen to you. Cassandra's are some of the sweetest people you will ever meet but if you piss them off they WILL ..um how do you say this.. JACK YOU UP. These girls are true to there word and as real as it gets. Nobody is perfect but Cassandra's are as close as it gets to perfection.", "x": -20.900165557861328, "y": -29.4183406829834}, {"term": "Sabrina", "definition": "Where do I begin? She is funny, artsy, crazy, beautiful, trustworthy, caring, and so much more. Sabrina will love you to the moon and back, and listen to you rant over the phone at 2am in the morning. Even when she's going through a rough time, Sabrina manages to keep a smile on her face. And this might sound weird, but she's angelic when she cries. Sabrina will cry with you, laugh with you and share your happiness. She isnt afraid to hop on your emotional roller coaster. In fact she'll help you get through it. She deserves so much happiness, despite what she might think. She is utterly stunning and a good dresser. I've never met anyone who could make sweatpants look so good. Her body is goals and she can be athletic. Guys want to be with her- but dont think you can take advantage of Sabrina because she's a crazy bitch and trust me, she'll have an army of friends to back her up! Sabrina is too pure for our world. I truly hope she finds tranquility and wins the battle against her inner demons. She is a very talented artist and singer (YES YOU ARE SABI). Shes super sexy, her kinks might surprise some people but its hot and attractive. Sabrina is a girl that finds family, friends, and independence very important. She wants to have arguments with those she loves, she wants internal happiness, she wants her dreams to come true, she wants love, she wants you to fight for her. She is so worth it. She is.", "x": -36.245277404785156, "y": -19.324974060058594}, {"term": "Alexa", "definition": "She is the most beautiful girl you'll know, she's really funny and down to earth, she has an amazing personality that you can't find anywhere else, she's caring, intelligent, beautiful, cute, hot, awesome, smart, lovable, pretty, incredible, fantastic, fun, weird, outgoing, gorgeous, breathtaking, amazing, and perfect, she fights for what she believes in, she makes you feel happy, she has a fun crazy side and a fun lovable side, she's everything a guy could want and more and if you have the chance to be with her treat her like no one matters", "x": -15.599405288696289, "y": -28.409778594970703}, {"term": "Angela", "definition": "A beautiful, strong capable woman. She is very smart and she has the most gorgeous, sparkling eyes. She is shy when you first meet her but once you take the time to get to know her she is quite fun to be around. She will never usually make the first move to talk to her crush as she is too shy but will start talking once her crush takes the time to talk to her. Angela is a girl who will stand up for what is right and won't let anyone get in her way. She also really loves sloths.", "x": 2.5717556476593018, "y": -37.03106689453125}, {"term": "Kathryn", "definition": "A girl who is: amazing, beautiful, gorgeous, and practically perfect. She has eyes like a goddess, they sparkle in the light. Her eyes are best noticed when she laughs/smiles. She always is able to make someone laugh and gives the best hugs. She is very talented, even though she is totally and completely bubbly and outgoing, she has her shy moments. She has a caring and compassionate side BUT she always loves a good party. She doesn't like to stop having fun, and she always wants to try something new. She has a way of making any moment of the day better with her smile and eyes. She is told by many that she is gorgeous and she blushes and tries to not talk about it. When guys look into her eyes, they can see the amount of kindness and generosity that is within her. She is a strong-minded chick, and doesn't ever give up on something/someone. She is easily fallen for and she falls easily too. Her personality is very ‘colorful', she is bubbly, kind, funny, passionate, easy-going, strong-minded, talented, gorgeous, sweet, amazing, and she is known for listening and always helping others. She normally puts herself last just to help others. She has a rocking body and is just completely adorable. She is beautiful to the extreme. When guys look into her eyes, they can't help to not lock eyes with her, and when they do they feel as if the world has just stopped", "x": 12.499564170837402, "y": -19.316518783569336}, {"term": "Katie", "definition": "Katie, a girl who is the total package. She's smart, funny, incredibly athletic, crazy, nice, has a nice body, beautiful eyes, a prefect smile, and has a nice personality. She's one of those girls who doesn't let anybody walk all over her. She's tough, and doesn't like to show weakness. Katie stands up for herself and others. Katie is protective of her friends and family. She falls in and out of love quickly, and if you play with her heart, she will give you absolute hell. Katie is also a bit insecure, but she won't show it. Katie can also be a bit intimidating too. Katie isn't afraid to be herself. She doesn't care what others think of her. She is a damn crazy girl! She's a lot more sensitive than you'd expect out of her. Be careful with her please. Katie is amazing...", "x": -8.390132904052734, "y": -36.39621353149414}, {"term": "Caitlin", "definition": "A person who is an intelligent, talented. Also somewho is caring and kind! She is easy to fall in love with, but difficult to fall out of love with. It's difficult to win her heart because she doesn't fall in love easily, but when you do you will have her forever!! She is confident when she wants to and she avoids to show some of her feelings. She is sexy, beautiful, and will do anythings for her friends", "x": 3.4629628658294678, "y": -40.45275115966797}, {"term": "Miranda", "definition": "This name means admirable in Latin. Miranda's are very friendly. She can be extremely funny, out-going, sweet, out-doorsy, stylish, and gorgeous all at the same time. A Miranda cares deeply for others. She is a thoughtful friend. She does have a temper, and is impatient. Also, Miranda's are determined and often called \"stubborn\". She can fit into many roles in life, but is happiest when with her true friends.", "x": -1.0807923078536987, "y": -20.924095153808594}, {"term": "Kelly", "definition": "Beautiful, strong-willed, sexy, smart, funny, spunky, courageous, and then some . Someone you can talk to from sunrise to sunset. The most amazing girl i know, always in the fast lane. You have to learn her, because if you don't .. you will forever chase her. Dreamy eyes, you will gaze into them and loose yourself. Partying and having fun, living liFe to the fullest, someone you can count on for anything. Once you get passed the outer wall of her being a so called hardass then you get to the sweet, compassionate, comforting person. You would not pass a \"Kelly\" especially this one and not stop. Not one for bullshit, she has been through enough already. Her heart has a barrier outside of it, time & trust.. You will know when you get through because she will sweep you off your feet... Before you know it, you'll be sitting on a cloud with your heart floating beside you.", "x": -19.049394607543945, "y": -15.430021286010742}, {"term": "Lindsey", "definition": "A Lindsey is a kind, selfless girl who anyone would be lucky to know. A Lindsey makes an amazing friend and is always there when you need someone to talk to. Anywhere she goes always ensures plenty of laughs and happiness, and her brown eyes are almost as big as her heart. She despises drama and never causes it, and one of her main goals in life is to just keep the ones she loves happy. She does have bit of a dirty mind, but is an extremely fun person to hang around with especially when it comes to trying new things. She is a beautiful girl both appearance and personality-wise, even though she can't see it. She asks for little but overall deserves so much more, and makes one of the best girlfriends any guy could want.", "x": 13.656323432922363, "y": -20.763290405273438}, {"term": "Isabel", "definition": "An insanely amazing, awesome girl who doesn't realise how awesome and how cool of a person she is at time. Can be a douche at times, and can be one of the kindest, sweetest people to you depending on how well you know her. She's also extremely beautiful but is defiant in believing so herself. Has beautiful eyes, and an amazing gift for stringed instruments and poetry. Can be very misunderstood but is amazing at understand other people and the world around her. If you are lucky enough to know her, it won't take much time for her to become one of your best friends and someone you probably can't live without.", "x": -2.5034008026123047, "y": -30.687889099121094}, {"term": "Catherine", "definition": "She's the most open hearted and kind girl you'd ever meet. You'd fall in love with her instantly and when you try to Un fall in love with her, you'll always find yourself back loving her. She's very sensitive and emotional but her smile and laugh can brighten up the room. She may not be perfect but at the end if she has fallen in love with you, no matter what goes wrong. That love doesn't go anywhere even when she tries to hide it.\r Catherine has such a big heart but sometimes gives it to the wrong people but she never stops. But once she let's go, she's not coming back.", "x": 23.515539169311523, "y": -19.47105598449707}, {"term": "Cassidy", "definition": "Cassidy is a girl who goes through a lot but doesn't want to burden other people with her problems so she keeps it all bottled up. Cassidy usually has a very bubbly personality, but will be very quite around people she doesn't know. Her parents named her after a Grateful Dead song and she never hears the end of it. She is a very loyal friend, but will fight against a friend if they turn on her. She is very hard headed and goes for what she wants in life. Cassidy can be a sporty person but would rather be at home watching Netflix. Cassidy tells it like it is, she isn't going to treat you like a baby.", "x": 0.3093390464782715, "y": -9.112825393676758}, {"term": "Leslie", "definition": "Leslie, ok she is one of those people who will be quiet around school/ campus. She's quiet when you first meet her (don't just ditch her tho) but when SHE feels comfortable enough around you, she is the funnest person to hang out with. She might not know what to say in some situations, either bc she's intimidated, feeling insecure or just doesn't know how to deal with it. But when she figures the shit out then she'll give you the best advice ever periodt!", "x": 2.182250499725342, "y": -35.603904724121094}, {"term": "Jacob", "definition": "Kind, sweet, funny, and sometimes immature. He knows what to say and how to make a girl feel good. He's always there for his friends. Also he has more than one side to him, and once you get to know them you'll fall in love. He always brings a smile to everyone's face. Sometimes he embarrasses you, but most times he's understanding. He loves to joke a lot, and make funny faces.", "x": 19.173185348510742, "y": 23.495893478393555}, {"term": "Michael", "definition": "Michael is a sweet guy. He is pretty attractive. He can always make you laugh. He seems brave, but he is very sensitive. He believes he is never good enough, even tho he is. He is a huge flirt, and cocky to some girls. Loves to have fun and live life. Hates to see loved one feel down and will try anything to help. he is very smart but doesn't show it.", "x": 3.0966498851776123, "y": 11.561824798583984}, {"term": "Matthew", "definition": "A Matthew (or Matt/Mat/Matty/Mattie) will make the best boyfriend/guyfriend ever. With their big brown eyes, and heart-melting smile it's hard not to fall for them. They are different, in a beautiful way. Possesses a very funny, odd sense of humor. They are there when you need them, and they value their friendships. They like to look good, and dress well. Handsome, and charming. They've had a hard life, but never gets kicked down and stays down. They change for the better, and stronger than ever. Very successful at life, make great Dads. Known to be players but when they meet that special girl, their sold. Matthew's come off as tough and solid, but deep down, their soft side comes out and you see the sweet gentleman in them. They're not popular, but not a loner either. Friends love them, and guys want to be him. They have a really laid back attitude about themselves, but at the same time they can be the life of the party. Even though they can be a jerk at times, they mean well and are really the nicest guys ever. If you have a Matthew, don't let him go. None other compares.", "x": 40.038482666015625, "y": 33.916046142578125}, {"term": "Joshua", "definition": "Joshua is a guy who has a lot more to himself than you think. He isn't shy but isnt really outgoing. He'd much rather be at home, alone, then at school facing all the work and challenge it brings. He goes to school anyways to see his friends, whom he trusts with most of his secrets and untold emotions. He respects those that he feels deserve his respect and when it comes to what he believes in, nothing can change his mind. He is wise, very wise. He gives the best advice and tries his best to understand you. He is the cutest thing you will ever lay your eyes on. His personality is different. He can be mean but can also be the sweetest in the world. He is loyal, trustworthy, kind, caring, loving, honest, and everything good in a person you could find. He has the biggest heart and a brave soul. He is everything a girl could dream of packed into one person. He's also incredibly funny and has real skills when it comes to video games. He is the most amazing person you will ever meet and one you will never forget. He will change your life and change it for the better.", "x": -7.306699275970459, "y": -0.23141825199127197}, {"term": "Nicholas", "definition": "A Nicholas (or Nick/Nic/Nicky) will make the best boyfriend/guyfriend ever. With their big brown eyes, and heart-melting smile it's hard not to fall for them. They are different, in a beautiful way. Possesses a very funny, odd sense of humor. They are there when you need them, and they value their friendships. They like to look good, and dress well. Handsome, and charming. They've had a hard life, but never gets kicked down and stays down. They change for the better, and stronger than ever. Very successful at life, make great Dads. Known to be players but when they meet that special girl, their sold. Nicholas's come off as tough and solid, but deep down, their soft side comes out and you see the sweet gentleman in them. They're not popular, but not a loner either. Friends love them, and guys want to be him. They have a really laid back attitude about themselves, but at the same time they can be the life of the party. Even though they can be a jerk at times, they mean well and are really the nicest guys ever. If you have a Nicholas, don't let him go. None other compares.", "x": 40.119651794433594, "y": 32.840885162353516}, {"term": "Christopher", "definition": "Christopher's tend to by shy individuals, but don't be fooled: when a Christopher emerges from his shell, it is like seeing the brightest, heart-warming rays of sunshine, on a rainy, cloud-besmirched day. His shyness acts as an obstacle in getting to know him, but don't give up. Once you know him, you'll discover that he's one of the most thoughtful, witty, intelligent people that you will ever encounter. Sometimes, when you're nattering away, to him, it may seem like he's not listening, but truth be told, he's always listening. Arguments and debates are his strong points (you can almost, never win.) He makes you smile, and laugh inadvertently- you don't even realise you're smiling, until he points it out with a magical, charming chuckle, in his voice. You feel like you could easily spend the rest of your life, in blissful contentment with him, even through the arguments, and the fights. In a nutshell, he's everything you've been looking for.", "x": 5.232997894287109, "y": 3.6934640407562256}, {"term": "Andrew", "definition": "t is Greek origin, and the meaning is \"man, warrior\". Andrews are athletic and knowledgeable and sometimes act shy and reserved but are really out going and crazy when you get to know them. They like computers and comics/super heroes just as much as they like sports, they are the best of both worlds. Andrews will be there when you need them, but you have to be there for them at the same time. If you are lucky enough to be friends with an Andrew you are in for a wild ride. Once you meet him, you will never forget him. Andrews are also quick on their feet and always have a come back ready for you..so be prepared. Sometimes Andrews have ego issues, they like to be the best and are extremely stubborn. They will make you laugh and make you cry, but you will always forgive an Andrew no matter what. Also they like fast cars. And drifting. Andrews will scare you shitless. If you ever meet an Andrew you will find out real quick that they are insanely hyper and visit the hospital a lot. Be ready you will probably be in a waiting room fo' eva. If you ever date an Andrew he will act like he isn't a good boyfriend or isn't good at dating, but really he is amazing, and is as close as a guy can get to perfect..as well as an amazing kisser. And most importantly if you ever fall in love with an Andrew you will always remember the time you spent with him, because Andrews will leave a mark on your heart that will never go away. Never let an Andrew go. You are insanely lucky to meet an Andrew.", "x": -8.69288444519043, "y": 50.17564010620117}, {"term": "Joseph", "definition": "Joseph, also known as Joey, Jeush, Joe and Xtiano, is a caring, passionate and intelligent man. As an entity of many talents, Joseph is a gifted guitarist, skillful DJ, and witty comedian. He is loved by his friends, family, pets, and colleagues but mostly by his meme lord fan girl. Joseph is the perfect man to fall in love with at first laugh. His charming personality, handsome looks, and brain drives people into a deep day dream state that transcends dimensions. Joseph embodies the perfection of Jesus Chroiist, in fact, he could be the second coming of Chroiist on earth. He performs miracles at work daily, and has Saint-levels of generosity and compassion. Wherever Joseph goes, people immediately melt with just one look of his God-like presence.  Despite making people smile from ear to ear while giving them butterflies, Joseph can also be annoying with his unfiltered remarks. However, he doesn't have a mean bone in his body and doesn't mean to hurt anyone intentionally. Joseph has the cutest laugh, kindest deep brown eyes, sexy salt and pepper hair, flawless olive skin, and silly boyish smile. His true beauty lies within his attitude, personality, talents and in the way he carries himself. In other words, Joseph is a wonderful person that will make your heart beat out of your chest for all the right reasons!", "x": 18.7141056060791, "y": 17.397310256958008}, {"term": "Daniel", "definition": "Daniel is one of a kind dreamer that will make an instant impression on you. He has a great fashion sense - he always rocks his high top Vans sneakers, camo details, denim jacket and MA brand which the world will hear about soon enough. He is a true hustler at heart who builds his life the way he wants to live it and does not conform to societal pressure followed by majority. Daniel is very active in the community and he truly values his close friendships. He always sports the biggest smile, rocks peace sign like no one else and he likes to start his Instagram stories with: \"Alright!\" He is well-known for his banana elevator selfies, recently resumed runs and the frequent use of nerd emojis.", "x": -5.954943656921387, "y": 39.00279998779297}, {"term": "Tyler", "definition": "Tyler is the most amazing person you will ever meet in this world. Although they are stubborn and very stupid sometimes, they will make you the happiest people in the world. They're so caring even if they can't show it all the time. They're a little more scared and confused than they'd like to admit. They act like complete bad asses but they're still scared to ever get hurt. They have piercing blue eyes and a smile they will melt you to pieces. An even better laugh that will make you smile so big your cheeks hurt when you hear it. Everything about them is perfect. Their hands are the best hands to hold. So big, strong feeling when you hold them. They make you feel secure. When they hold you in their arms that's the happiest you'll ever be again. No place, no person; after you feel that bliss of being in their arms, will ever compare. The way they hold you, how strong their arms are around you while they're rocking you to sleep. You feel so safe and secure. Like nothing could hurt you or ever break your happiness. Sometimes they come from a rough past. Which is difficult. But you just have to show them that you love them. They're harder to deal with then most boys, but they are definitely worth it in the end. If you give it time, they'll love you forever.", "x": 23.565170288085938, "y": -29.069849014282227}, {"term": "Brandon", "definition": "Brandon is one of the most amazing guys you will ever meet. He is extremly caring and sweet as well as funny, and intelligent. Winning an arguement with a Brandon is quite a feat. Hard on himself and his looks, but very cocky about his intelligence. Girls always flock to Brandon's because his humor is very attractive to the people around him. On the outside Brandon's appear like assholes and meanies, but the people closest to him know deep down hes a sweetheart. Brandon will do anything for the person they love. He will love you forever, as long as you do the same. Can't be with anyone, needs the true love of one to make him happy. Extremely loyal and protective. Able to make you feel super special, like your the only girl in the world, because to him you are. Brandon's love doing unexpected romantic things for the person they love. Hates being left out of conversations and gatherings. Timid at first but when warmed up to isnt afraid to show passion and emotion. Someone who you can talk to and will truly listen. Not the best at making conversation but will always try his best. Amazing friend and boyfriend. Love him with everything you have and he will make you his entire world.", "x": 11.028352737426758, "y": 37.90839767456055}, {"term": "Ryan", "definition": "Ryan is a cute boy who is very shy and quiet at first, but when you get to know him he's very friendly and doting. He'll still be very quiet though. Ryan has a sexy voice so when he does talk, it's totally worth the wait. Despite his tall and masculine physique, he has a bigger bubble butt than most girls.", "x": 3.0351107120513916, "y": 4.561707973480225}, {"term": "Austin", "definition": "A sweetheart of a guy who can light up anyone's day with his jokes. Austin may not be the most popular guy but is definitely the coolest. He's easy going, easy to talk to, funny, cute, incredibly fit, smart and wise beyond his years. He's a little shy but insanely outgoing around his friends. He can make anyone laugh, knows how to treat a girl right and is loves cuddling. He genuinely cares about everyone he loves and loves everyone. If you get to really know him you'll realize he's a deep, insecure and one of the most amazing friends you will ever make in your entire life. He'd make the most amazing boyfriend in the history of man-kind He's also incredibly brave and isn't afraid to fight for what he believes in or wants. If you ever have the privileged to have him in your life don't take it for granted and never let go of him as a friend or anything else. He knows what to say, when to say it, and how to say it. He's a good listener and gives the best advice. He never judges or makes you feel like you're nothing. He has the most beautiful blue eyes you've ever seen and is the easiest person to love ever. He's pretty much every girl's dream guy and more. Incredibly rare down to earth human being and is just plain awesome. Words can't describe this dude.", "x": -5.543865203857422, "y": 22.09513282775879}, {"term": "William", "definition": "A great guy. He can be hard to get to know at first but once you do it'll be totally worth it. He's the best friend you'll ever have. He is really protective of you. You can talk about anything to him and he'll never tell anyone. You can trust him with anything. He's smart, serious, but also funny. He knows all the right things to say to make you forget about your troubles. He encourages you to be a better person. You can never stay mad at him for long.", "x": -9.40056037902832, "y": 21.151941299438477}, {"term": "John", "definition": "John is infinite and multi-faceted. He is generally a level headed person but when he comes under pressure and is compelled to make a decision thats when things get vexed.  John is tall has brown hair and a tan, perfect skin and blue/green eyes that hold many secrets. John has great legs and nice muscles. John is a kind compassonate individual. He is a man of complete integrity and exemplary manners. He is a man of little words, believing that his actions will speak louder than words. He has a dynamic work ethic. He is strong, handsome, sexy and beautiful. He is intelligent, funny, loyal, trustworthy, full of charisma, loving, teasing, sweet and thoughtful.  John always likes to plan and think ahead for the most part. John strives to do things for the better, hardly selfish, observant and loves his family.  He leads a very intense life and proves himself hardy in doing so.  A guy that is outgoing and friendly. Everyone knows of him but he keeps very few close friends. Shy and quiet but usually willing to open up to you when you get to know him and he knows he can trust you. Then he can tell you what is on his mind and can be very emotional which does bring about his true feelings.  John has a playful side to him when he feels at ease with someone that he befriends. He can then be a total goof! Once you befriend John he will be your friend for life. He is loved more than he'll ever realize.  John is simply like the Heavens above, SUPREME BLISS.  Tender Kisses", "x": 0.27598264813423157, "y": 52.65171432495117}, {"term": "David", "definition": "Most hilarious person you will ever meet. Sweet, kind, of course funny, and cute, although he might admit to none of those things. Unbelievably caring and willing to stand up for what he believes in, stick up for friends/girlfriend, and not afraid to just have fun no matter what anyone thinks. Very intelligent, sometimes even thinks too much into things. Has a lot of friends, but loses temper easily when it comes to certain things. Mess with the people close to him? Watch out. Very protective and loving! And, overall, just an awesome person.", "x": -12.487006187438965, "y": -28.12297821044922}, {"term": "Zachary", "definition": "Zachary is one-of-a-kind. No one else is like him. He is an oddball.  If he cares about you he treats you like royalty. He wont let ANYONE mess with the ones he loves. He's charismatic and the nicest person you will ever meet. He's different and special. He wont ever hurt you. He has a bit of a temper but its best for the people around him, and his own safety. A protective, harmless, respectful, caring, weird wonderful person. You'll fall in love with him in the first three weeks of knowing him. <3", "x": 0.003990631550550461, "y": 6.7128682136535645}, {"term": "Anthony", "definition": "Anthony is a caring, loving, and loyal person. He knows how to make your day with one sentence, and could cheer you up in a heart beat. You'll never really know how amazing Anthony is unless you talk to him. Many people have made the mistake of not talking to him, and they truly do not know to what extent how amazing he is. Anthony is quiet, and collected. However, if you're his girlfriend, you lucky thing, you'd know just how funny and out-going he can be. You can talk to Anthony about anything, he does not judge and loves you no matter what. He'll always be there for you, because that's in his nature to. He could never be mean without a reason, and even when he is mean, he's almost never harsh with his words. He's a peaceful man, but he loves guns.  He's a very humble man, and would never admit to being all these great things. He's perfect. He's the perfect boyfriend, the perfect husband, best friend, anything. He's adorable in every way but very manly. He's a very well balanaced man. His looks equal his personality. He's absolutely handsome, but again, he will never admit to it, because although being very perfect, he is one stubborn man. However, there is no real flaw to him. If you get to know Anthony, and he falls in love with you, you're set for life. Don't ever let go of Anthony, he's yours forever, because he truly loves you.  He's a man that goes by the motto, mean what you say, and say what you mean. He's just the total package. Perfection, he is that definition.", "x": 0.15665319561958313, "y": 28.379568099975586}, {"term": "James", "definition": "James is a irresistible bad boy who is funny, He has a great personality and he's a total cutie. He is chill, handsome, funny, and down to earth. He has pretty brown eyes, thick eyebrows, dimples when he smiles, and blonde/brown hair. Guys will get mad at him because their girlfriends will be staring at him. If you try to bully him it won't work but if you try to fight him he'll beat your ass.", "x": -13.27281665802002, "y": 44.8389892578125}, {"term": "Justin", "definition": "Best friend that you could ever have. Can be very annoying and retarted sometimes but other times he can be the sweetest guy in the world, he loves memes and is the funniest person ever!  If you acctually meet a Justin u are the luckiest person on earth, he has been through tough times but can always fight the urge and keep up with his life, he battles with his fears and always wins. He's amazing at maths and he loves school. He has an amazing personality and first he will be shy but if you get him to trust you he will be the sweetest. He loves playing video games on any device, usually plays on a console. He is an amazing person with an incredible personality. So if you ever go by a Justin you are so lucky.", "x": 31.61066436767578, "y": 24.568771362304688}, {"term": "Alexander", "definition": "Usually a very very very goodlooking straight gentleman that has great taste in women. He has a crazy side to him but only shows it infront of true friends. Has great style, is hilarious, amazing, caring, sweet and will make you smile. You will always have a good time with an Alexander, so if you got a friend named Alexander count yourself one of the luckiest people in the world!", "x": 21.230077743530273, "y": 15.529539108276367}, {"term": "Jonathan", "definition": "The sweetest guy in the world. Jonathan always makes you feel better when you're down, it's in his nature to help. He loves passionately and unconditionally. He is a true friend above all else but if you are lucky enough to be his lover, he will treat you like a Queen. Jonathan is an old soul with wisdom beyond his years. When you look into his eyes, you can see his heart, his compassion and his pain. NEVER take him for granted. He is the one who will always be there for you.", "x": -17.32704734802246, "y": 19.591806411743164}, {"term": "Dylan", "definition": "Dylan can be the coolest guy in the world or the biggest asshole. depending on how you take him.  Dylan has a funny and a dark sense of humor that takes time understand.  Their are people that wanna kill Dylan and be their bro.  He can be an total backstabbing bitch but that's how he is .  Dylan can be know for getting along with strangers being nice to them or being a total jerk to them.  Dylan is a brave and strong .he can be a leader if he wanted to be one.  Dylan almost always has a plan B  He is a trouble maker but always finds a way out of it. The only times for getting in trouble is probably getting radded out by others.  Dylan is not know for his looks but people that do see that in him are people that wanna be with him for a long time.  Don't get hooked on the fact that guys should break the ice.Dylan is different he tends to act shy differently around girls he likes.  Dylan can be a really sweat romantic guy if you give he the chance to be.  Dylan has a soft side that very few people will ever see.You can see this side of him only if you get his trust.if your a guy good luck getting to this part of him.  If you know a Dylan stay in contact with him because you will never ever find anyone like him.", "x": 10.471386909484863, "y": 41.29280090332031}, {"term": "Noah", "definition": "Noah is the most entertaining person you'll ever meet. He has that perverted and sarcastic hilarious humor. He is sweet and romantic when he needs to be. You can count on him to make you feel better at any moment. He is definitely the smartest person. He knows the answer to all your questions. He has multiple talents that will continue to amaze you. He is the music genius. And not to mention he is hot, ATTRACTIVE,and gorgeous! Any girl who rejects him will definitely regret it later when they see how awesome he is! Any girl dating him is the luckiest girl in the world!", "x": 22.674528121948242, "y": 19.29152488708496}, {"term": "Christian", "definition": "Christian is the type of friend who has your back. If your world is going to hell, Christian will be there with you every step of the way. He is the one that you can talk to and trust when you feel like you have no one. When you are in bed with him, it is the most comforting thing in the world. He is the kind to come over after you have had a rough day, help you and then want to cuddle with you till you fall asleep. When he wraps his muscular arms around you, you just have this feeling of safety and security. If you are his girl, he will make you feel like you are his world. He is a super strong physically and emotionally. Christian is also not afraid to break the rules or tell you how he feels. That is the part of him that makes him the \"realist\". Even if you aren't dating a Christian, try to get to know one.The best thing to do around Christian is to BE YOURSELF. The most attractive thing about Christian though, is him smile. He is the happiest person you will ever meet, and you can see his smile and hear him laughing from far away. His eyes give off a feeling of love and hope and protection. Christian also has a very cool super power. He can either make you fall in love, or make you hate yourself. He could make you want to do things that you normally wouldn't do, and think about things you wouldn't normally think about. I promise to you, Christian is a very rare type of person, and you have to take him while you can. He will love you to the moon and back, or Earth dies.", "x": -43.63938522338867, "y": -13.634974479675293}, {"term": "Robert", "definition": "A sexy sexy man with a massive schlong that all the ladies love. He is the lord of memes and is respected by all. Anyone who confronts a Robert in a rude manner gets dominated by Robert. What a fuckin g legend", "x": 15.573647499084473, "y": 32.2186164855957}, {"term": "Samuel", "definition": "As a person he is remarkable. One of a kind and even though Samuels can make mistakes in the past,they are humans, but they learn from them. There personality is great. They may be very shy and like to protect themselves but they def love to have a good time and have a great sense of humor. They are usually athletic and have a great smile and make the most cute/attractive faces. As a friend he would do anything to help\r You in a problem. Samuels are great to confide to and will\r NEVER give you bad advice. They usually come from a great family who is non-judgmental and have good morals for themselves and there children. They trust who their kids befriend and will always be there to help in any sistuation  As a boyfriend a Samuel can be remarkable to their girlfriend. It may be hard for him to express himself but he truly had a kind heart. Even though it takes along time for a Samuel to open up once they do, you'll be so glad that you made the choice to allow him into your life. They will love you with everything they have and do anything to preserve their relationship and stay true to themselves.  If you ever think about dating or befriending a Samuel do it or else you'll be missing out.", "x": -8.531723022460938, "y": 23.634302139282227}, {"term": "Kyle", "definition": "Kyle is a person who acts happy around friends but at home is emotionless and tries to ignore his feelings and help others no matter what", "x": -45.72644805908203, "y": -20.932212829589844}, {"term": "Benjamin", "definition": "The absolute cornerstone upon which chivalry stands, Benjamin is a kindhearted, loving, and intrepid soul. Though strong, intelligent, and wise, Benjamin sometimes harbors secrets deep within, only to be entrusted by a small number of his closest companions. He can tend to be quiet and reserved in most situations; however, Benjamin's true colors are revealed when he feels comfortable around and pleased with his company. He easily captivates every girl that befriends him; only one has ever truly captured Benjamin's heart. A stunning smile and a shining soul, Benjamin is the ideal icon of a true gentleman in today's society.", "x": 6.767901420593262, "y": 9.234668731689453}, {"term": "Jordan", "definition": "A Jordan is super athletic. He is very popular. He is sweet but don't get me wrong if u say something wrong he will attack u like there is no tomorrow. Jordan has a lot in common with his friends. He is super funny he knows how to make everyone laugh and he can make the funniest faces ever! When he likes someone he falls in love with them and is very sensitive so if u break a Jordan's heart good luck. A Jordan always has a girl best friend who they have a lot in common with. Many girls like him and many guys want to be him.", "x": -10.662601470947266, "y": 47.56864547729492}, {"term": "Thomas", "definition": "Thomas is a very mysterious guy. Often people see him as an outsider never giving him the chance to prove himself. He is overlooked, but shouldn't be, because when you make a friend like Thomas, you will never let him go. He is kind, caring, funny, and slightly flirtatious. More than anything he wants a significant other, someone who will appreciate him as much as he does others. When given a chance he can enchant a girl with something more powerful than looks... his personality. Thomas will often crack jokes that would light up any girls face. His largest weakness would simply be his ability to remove himself from any and every situation. He hates negative confrontation, some would call him a “peace maker”. This isn't a bad thing, but Thomas deserves better than to lurk in someone else's shadows. He's too good of a person to not be seen as such. If only he knew that.", "x": 0.22721576690673828, "y": 24.527013778686523}, {"term": "Nathan", "definition": "One of the greatest guys alive. He can be quiet and serious but suddenly turns into this chatty bubbly hillarious person. Someone who understands how to act around different people, he takes other peoples thoughts into mind. He can spend hours thinking of something that means alot to him. One of the best boyfriends, he's sweet; reliable; trustworthy; loving; caring etc. He's one of the funnest people to hang round with, whatever the weather. He can be flirtly but also knows how to be just a simple friend. Any person who knows a Nathan is truely lucky, and to be his girlfriend then they're truely blessed. He's also one of the greatest friends you can ever have, he can relate to things that you say, understands how to talk to someone depending there mood. He can be quirky at times, at is never seen without a smile in his eyes. Girls hearts melt around him. He has a story to tell. A huge dog-lover. A guy called Nathan is like an Angel from heaven, you don't expect to need him to be in your life, but once he is, you realise how much you do need him and how much you never want to loose him, you couldn't loose him! Nathan is a pleasure to both guys and girls, he's can have a laugh, give advice, be blunt, you can talk with him about anything. He's the most beautiful creature alive. When you see him you smile, either on the out or inside, or even both. He's sucha great guy!", "x": 29.93740463256836, "y": -1.1624135971069336}, {"term": "Cameron", "definition": "Cameron is the silliest guy you'll meet. He loves inappropriate jokes and has a few close friends. His girlfriend is treated like a queen, and he can be lovey-dovey at times, but serious at others.", "x": 14.921355247497559, "y": 39.96920394897461}, {"term": "Kevin", "definition": "Kevin is basically the best boyfriend ever. He's understanding, caring, and a great listener. You can act like a five year old with him but also have heart to heart conversations. Kevin has his struggles but always puts other people first. He acts strong but has a tendency to break down and not ask for help. He has the best eyes and personality. He can always manage to make you smile. Kevin is the sweetest, funniest, most amazing guy you will ever meet. It is extraordinarily easy to fall in love with his cute, sweet, and incredible self.", "x": -10.025545120239258, "y": 37.846290588378906}, {"term": "Jose", "definition": "A person who can get you so mad but so in love in 5 seconds. Who you can argue with but when you look into his big eyes his long eyelashes bat away any negative thoughts and you still want to build a family with him due to his calm, collected, and understanding nature. He has the ability to make you cry then make you laugh because of his positive vibe you can't ever stay mad at a \"Jose\". He is reliable and he is just a great man in general. He is a great spirit and will make a great husband and father one day. If and when you find a Jose don't let him go. It will hit you that you made the biggest mistake of your life.", "x": -11.077454566955566, "y": 38.592952728271484}, {"term": "Hunter", "definition": "Hunter is often a guy name. Commonly tall, great skin, normally white. Thinks lowly of themselves with slight trust issues, but everyone loves them. Very cute, maybe even hot. Honest, and very kindhearted.One can also be quite shy. Never do you ever hear a Hunter insulting or being rude to someone unless it's a joke. Very creative and musical. Somewhat of a ladies man, but very committed. Some girls may think of the Hunter in their life as perfect. Hunters are modest, and treat their girlfriend lovely. Very respectful, honest, and so loving. Once in the arms of a Hunter, don't let him go. I guarantee you'll regret it.", "x": 1.6768834590911865, "y": -4.818639278411865}, {"term": "Ethan", "definition": "Ethan is a little insecure but really cares about those around him, he makes everyone around him smile and is very funny. Ethan, even if not making a solid effort to do so, will make you want to instantly become best friends with him. He has a very comforting personality and will do anything he can to make you feel at ease. He does have some deeper layers only people close to him get to see but Ethan's bond to them makes them feel comfortable enough around him to speak and talk about any deep issues him or the other person are dealing with. He is the most wonderful person to talk to if you are feeling down or just want to delve deep into your issues without contacting a professional. Even if you don't know him in person you know he is a very cute and amazing person. People who are the most evil and see through the happy mask he sometimes puts on to put people around him at ease may try to put him down but he tries to keep his head up if possible and talks it out with his amazing friends he made from being an amazing person.", "x": -5.801001071929932, "y": 20.381315231323242}, {"term": "Aaron", "definition": "A hardworking dude with a great sense of humor. Best known for finishing jobs with pizzazz and pride, breaking tension with jokes and puns, and communicating with astuteness and heart. Aaron also is a master of hospitality, knowing how to make people feel welcome.  Some people see Aaron as cynical and jaded, and--to be fair--sometimes he is that. But under the surface is a beating heart that hopes and dreams, that sees beauty and light and feels deeply. Quick of wit and perception, Aaron is fun to talk with, and someone who provides thoughtful and stimulating conversation.  Most of all, Aaron means someone who knows how to act according to his code of honor. He may not always voice his thoughts, but what he does say, he says because he thinks it right or funny, not to people please. He is a giver of compliments at times--not as a means of sucking up--but for the sake of making other people feel good. He is a warrior of heart, and acts from his heart.  When life throws rough punches his way, he holds his footing, and keeps on going. He is loyal. One thing that holds him back is that he's been hurt and abandoned, and he struggles with trust and self-worth. But he is far more valuable than the finest precious metals or gemstones. One day he will realize his value and will know and receive the love and loyalty he has been craving. Til then, he suffers, believing the lies that he's not worth the effort and that he will always be alone and rejected.", "x": 6.180791854858398, "y": 48.731651306152344}, {"term": "Eric", "definition": "Eric seems quiet but when you get him talking he never shuts up. Super sassy and can seem intimidating but is a total sweetheart. Is loyal, brutally honest, and will do anything for you. Also, he has great taste in music", "x": 2.8916335105895996, "y": -1.2090381383895874}, {"term": "Jason", "definition": "Jason is a very kind hearted person. He can be shy at many times and you think he's a total creep until you really get to know him. He is crushing on this one girl that he can't possibly get over. He is very loyal and would sacrifice everything for his friends and family. His thoughts in his head keep killing him and killing him. He also sometimes overthink things. He jokes around a lot but can be very serious when needed. You might not tell from his outside but he is a very smart person. He doesn't like crowds and lots of people. He is more of a simple yet hard to understand person. No one in the world would ever begin to figure out what is in his thoughts. Jason in a wonderful man.", "x": -5.73553466796875, "y": 1.5137025117874146}, {"term": "Caleb", "definition": "A generally loyal person who sticks up for his close friends and family. He's quite attractive, but sometimes unintentionally hurts others with his actions. He is probably on his phone right now posting memes or pictures of his friends. A Caleb is always interesting, never boring and has a dirty sense of humor.", "x": 16.26372718811035, "y": 41.171470642089844}, {"term": "Logan", "definition": "Super nice guy. Usually is a very good guy friend. He can make you laugh so hard you cry. He's an athletic dork because he loves sports but also loves games. He will stay true to you unlike many other guys, and has a sweet personality. He gets caught up on one girl but never finds the guts to tell her. There's always one girl who loves him but never says it, though he knows she likes him. He always tells her he only likes her as a friend but she's the girl he's caught on. These are the best guys in the world!!! He is very passionate about somethings, and stands up for what he believes in. As well as his friends and family. They like to make friends with a lot of people but he gets fed up quickly. He knows his limits and never associates himself with idiots. He is good in school but definitely not a nerd. He has a soft spot for animals (dogs especially.) Sometimes doesn't like cats though. He hasn't had the best life. He is sometimes adopted, because something happened to his parents. He doesn't mind hanging out with girls younger than him or them coming over when his friends are around. His friends always know he likes his friend (who is a younger girl) and that she likes him back. They always bug him about it but he ignores them. If you find a Logan keep him close and NEVER let go. NEVER give up either, if you're that girl he'll come around eventually.", "x": 12.708847045898438, "y": 0.9156420826911926}, {"term": "Brian", "definition": "One of the best guys you'll ever meet. He's the biggest dork with the biggest heart, and no matter what kind of mood or funk you're in the always manages to lift you out of it just with his presence. Brian is easily the type of guy that you could see yourself spending the rest of your life with, he's loyal, sweet, hardworking, and kind beyond all measures. Brian is an irreplaceable individual who makes more of an impact on people's lives than he knows of. If you have a Brian in your life, give him the absolute world because he deserves that and more.", "x": -15.5731201171875, "y": 25.488452911376953}, {"term": "Adam", "definition": "Adam, someone who is amazing without knowing it, someone who is easy to love, someone who is truely caring. Adam is the type of person who is so forgiving and loving...Someone who is so trustworthy and reliable. You would be lucky to have him in your life, and if you ever lost him, it would break your heart. He is the best friend you could ever have and you can't help to be in love with him. He is one of the most handsome guys you will ever see in your life, no matter what he says. He is someone you can make such happy and amazing memories with, memories you will never forget. He is someone that can leave you speachless with his words.. He is someone you know you aren't good enough for, but you can't help but love him with all of your heart anyways. He has such a big heart..and great soul. He is the kind of person that deserves the best in his life, and deserves to be loved and cherished.", "x": 4.908568382263184, "y": 37.00674819946289}, {"term": "Cody", "definition": "He's the best boyfriend a girl could ever have. He has a sense of humor, and sarcastic most of the time.. He jokes around a lot. He's a wonderful person inside and out. Attractive, no doubt. He is very faithful and always shows his sensitive side around the girl he love. They will do anything to please them. Probably the best guy you'll ever want. Cody's are the best.", "x": 13.31447696685791, "y": 38.90576171875}, {"term": "Juan", "definition": "Juan is one of the best people you could meet. His personality is one of a kind. He's one of the funniest people. He can be sarcastic and stubborn at times. He's smart and understanding. He's there for you. He knows how to treat a girl and make her feel special. He's a jealous guy when in a relationship only because he's afraid to lose you. He's romantic and will go through so much just to stay by your side. He's a guy with real feelings and will know how to make you smile even on your worst days. He'll make you feel worth more then what you think. You'll never wanna leave his side. Juan is basically perfect.", "x": 1.3082038164138794, "y": 15.121674537658691}, {"term": "Steven", "definition": "A very cool guy who makes everyone laugh. Once you meet him, you will want to be his friend right away. He is super cute and very good-looking. He has amazing taste...in music, clothes, food, everything. Every girl secretly wishes that he could be her boyfriend...mainly because everyone knows that he likes commitment...mainly because he is sweet and knows how to treat a girl...mainly because however strange and wierd he may be, he's perfect. In his own little way, he is perfect. Yes, he is awesome!", "x": 21.4287109375, "y": 18.23105239868164}, {"term": "Connor", "definition": "Connors are perfect. They have brown/blonde hair and dreamy brown eyes you could get lost in! Their smiles make your day and you can't help but smile along side of them. Connors are nerdy and geeky but at the same time very athletic! They play any sport that involves a ball. They are also incredible smart! They also get along with many people, but have one group of friends who know how to have fun. Connors are hilarious and tell the best jokes. They also are super supportive and will always have your back no matter what! Connors make the bestest friends. Connors are not afraid to be weird. They are also shy around certain people but once you get past the shyness they are the best people to be around! They have a loving nature that is seen by all.", "x": 18.371456146240234, "y": 5.598196029663086}, {"term": "Timothy", "definition": "A man. A man of strength. A man of a thousand loves. A man who gives too much to receive too little. A man who gives all his happiness for a smile. A man with the hottest butt on the planet.", "x": -17.52719497680664, "y": 26.24338722229004}, {"term": "Charles", "definition": "Awesome, Fucking awesomest person the world, attractive, smart, loyal, best friend you can ever have, nice, friendly, funny, tech savy, every girl wants him, every guys wants to be him, the guy Chuck Norris won't fight, the guy Eminem won't rap the guy Barry Sanders won't race, gets what he wants, good musician, rich, damn sweet, best person to walk the Earth, legendary", "x": 4.698993682861328, "y": -5.106294631958008}, {"term": "Isaiah", "definition": "The guy who can make even the saddest person laugh. He has an amazing personality, very funny, and very cute. He always seems to have a twinkle in his eye. He is very out going but is also very quiet. He may seem aggressive but it takes a very special person to see the sweet person he really is and bring out the hopeless romantic he is. Anyone who is lucky enough to have an Isaiah in their life is very lucky and should Charish him.", "x": 10.41938304901123, "y": 19.773218154907227}, {"term": "Jack", "definition": "Usually Jacks have feelings for a certain person but they are too shy to tell them. The people they like probably like somebody else but they dont care. He is smart, funny, awesome, hot, and doesn't give a crap about what other people say to him. If you know a Jack you are one lucky person to be his friend! :)", "x": -5.6677775382995605, "y": 2.7822208404541016}, {"term": "Gabriel", "definition": "The type of guy who can make you laugh, but has that serious side of him. He gets what he wants when he wants it. And don't get me started on his dimples, you can see them from a mile away. He tends to be kinda quiet but only when he is making a dirty plan. But he has a side where you think of him as a brother... and you never want to hurt him. You can tell him whatever and he'll listen, and if he likes you enough he'll tell you stuff about him he wouldn't even tell his mom.", "x": -4.045666217803955, "y": -7.900444030761719}, {"term": "Jared", "definition": "A guy who has it all. Great personality, wity, charming, incredible looks and smart. Perfect compassionate lover with the know how to make you feel your best. Has an ego burried deep inside. Very sensitive and doesnt know just how great he is. Always thinking he is not enough. Bashful at first but once you get to know him, he turns into the coolest and funniest person you will ever meet. Can be very jealous but extremly cute when he is. The most perfect, wanted, and needed guy.", "x": 3.7596659660339355, "y": 13.168940544128418}, {"term": "Luis", "definition": "A Latino male with dark hair and eyes. Knows how to dress classy while still being the most honest and respectful guy. Every girl's dream boyfriend. Usually difficult to understand and emotional at times. Shy at first, but if he opens up to you he's the best lover you'll find. Generally attracted to blondes, and will always find a way to satisfy your love cravings. Awesome bro to be with and loves music. Isn't afraid to dance a beat if he feels like it, but he's modest so he doesn't try showing off. Very straight forward, and pretty oblivious to flirts. If you like him say so, he wont play tricks or cheat, so dont worry. If you let a guy like this go, you've gotta go see a mental hospital for your stupidity!", "x": 1.7937091588974, "y": -3.2176995277404785}, {"term": "Sean", "definition": "Sean is a person who will never fail to make you laugh. He is caring and is always willing to help others - if you have an issue he will listen to you and he will always be there to support you. He is very connected with his spirituality and no one will ever love you and appreciate you like Sean does, thats why he despises it when people break his trust. Sean is great company and you could never get bored around him. He is gorgeous and has beautiful eyes. He is absolutely nuts but in the best way possible and he was born to be a star.", "x": -9.494410514831543, "y": 26.27050018310547}, {"term": "Evan", "definition": "One who is smart, intelligent, funny, amazing, and incredibly cute. The guy all guys want to be, and all girls want. He's honest, truthful, loyal, and just generally a good human being. If you have an Evan in you're life, don't let him go. He's the best person who will ever come into your life and will definitely make in impact for the better.", "x": 16.207826614379883, "y": 14.299644470214844}, {"term": "Alex", "definition": "A genuine, but sometimes secretive friend. He is logically oriented and a cunning planner. Although he can easily attain a partner, he usually tends to be a lone wolf because he doesn't believe in a frivolous relationship, and yearns for true love. They tend to not subscribe to the conventions of society, doing what they feel is most entertaining or comfortable. He is self-validated, and a risk taker, although his outward confidence hides a more vulnerable character. True Alex's won't be involved in activities like Football and Lacrosse, the ones who do are usually shorter and less comfortable with their masculinity. Due to their creativity and determination, Alex's are goal-oriented and work tirelessly to reach their long term mission. He loves having fun and will risk embarrassment for a good laugh. He never feels the need to drink or do drugs because he doesn't need them to enjoy life. Overall, Alex's are a constant source of laughs and are exceptionally loyal friends you'd be lucky to have.", "x": -1.5671581029891968, "y": -1.6716400384902954}, {"term": "Carlos", "definition": "He's the sweetest guy you could meet, he learns from his mistakes and if he knows he hurt you he'll realize it and want to fix it! Carlos is also a ladies men. Every girl wants him but they're to scared to tell him or either they're all up on him! He's honest with you! Someone real 💯 he's not afraid to go for it even though he knows what could happen! Loyalty is true from him, he says he got a girl back off it's hints that he GOT a girl and don't want you! Carlos has a lot of talents if it not sports it's a musical kind/artistic/etc every Carlos has a lot of talent they just don't want to admit! Let's not forget he's either quite but once you get to know if he's funny, great to talk to when your bored! Or he's outgoing and wants to make people feel as comfortable as he can!", "x": -4.3545942306518555, "y": -5.299099445343018}, {"term": "Elijah", "definition": "Elijah is a gentleman & so sweet,if you ever meet a Elijah then make sure to keep him in your life forever.He may not be the ladies man,but he is the man who would only have one girl on his list & no other girl would interest him.He has a loving heart & is always polite.He is the best of the history of best friends. Elijah's name is in the Bible & definition for Jehovah is God.He is one of the most humble people in the whole world, he will always be loyal to you. He'd always be there for you & he is one funny &humorous guy. Any girl that has him is truly blessed. Hes an unforgettable person, he is great at everything he does.He is the most athletic & talented person,whether it's swimming,playing the guitar,basketball,golf & etc. He is a beast when it comes to him running track. Elijah is so supportive and is one handsome guy. No one compares to him, he is one of the greatest people you'll ever meet. He comes from a good family who loves God. Elijah's eyes are very stunning once you actually take a look in them, his voice is one of the most attractive things about him.He looks for a relationship he'd last a lifetime with and not hook up with every other girl. He never wants to go to parties and get drunk, or take drugs. He has a huge heart for animals, especially dogs. Elijah's mostly clueless and may not see the perfect girl in front of him but once it's God's time, God will lead him to the perfect girl.", "x": 23.942569732666016, "y": 33.42982864379883}, {"term": "Richard", "definition": "Heart of gold. He is extremely kind and always compassionate. Puts others first before himself, but still manages to have a thoughtful opinion and holds true to his beliefs. The best boyfriend a girl could ever ask for. Beautiful eyes, great body, FANTASTIC hair, impeccably dressed. Extremely intelligent. Knows so much about the world and the people around him. Could talk to him for hours about nothing. Very mature for his age. He knows what he wants and how to get it. Someone you will always want to have by your side-- your life will change once you meet him.", "x": 28.820825576782227, "y": -2.600029230117798}, {"term": "Nathaniel", "definition": "A very loyal, sweet, and caring person. A good friend to have, he will always be by your side and never betrays anyone. Usually a Nathaniel is a bit shy when asking out his crush, but will always be there for her. Around his crush he would probably try to make friends with her. Most Nathaniel's are on the sweet side meaning no matter what he will make a friend feel happy even if it mean making him feel terrible. He is trust worthy and won't tell anyone a secret unless its his own and he is telling a good friend or GF. It's barley possible for him to cross the line because he loves his friends more than himself. If you're friends with a Nathaniel then you're very lucky. He will always help you with anything you need/want. I'm happy that my best friend is a Nathaniel..", "x": 28.567068099975586, "y": 36.53742599487305}, {"term": "Patrick", "definition": "The most amazing guy you'll ever meet. He's so sweet and caring and very attractive. He can always make a bad day so much better. He'll always tell you how much he loves you. He's the kind of guy you wouldn't mind spending your life with. If you're dating a Patrick, never let him go. He's always there for you no matter what. Patrick can always tell when something's wrong and he can make it better. He's your soulmate. Patrick will love you like no one else can. He's really the most amazing guy you will ever meet.", "x": -15.706080436706543, "y": 18.713741302490234}, {"term": "Isaac", "definition": "Literally the best thing that will ever happen to you. Although literally everybody he comes into contact with either ends up becoming friends with him within a matter of days or falling madly in love with him, he remains down-to-earth, kind, and completely oblivious to how much everyone loves him. He's hilarious, sweet, and the best person to just sit down and have a really deep conversation about anything with. Say what you want-he won't judge. Isaac is also unimaginably talented, and is killer at drums, guitar, and pretty much any other instrument he touches. Although his perfection is almost overwhelming, it's somehow still easy to talk and joke with him like you've been best friends for years. If you find yourself an Isaac, make sure to hold on tight-there's nobody quite like him out there, and you'll most definitely regret letting him go if you do.", "x": 0.7872391939163208, "y": 30.65608024597168}, {"term": "Seth", "definition": "This super suave chappy who will have you drooling at hello. A Seth is a handsome, intelligent, witty, guy with snuggles that will make you feel as though you're the luckiest girl on the planet - which indeed you are if you have the fortune of being snuggled by a Seth! This cheeky chap will have beguiled you with his cute boyish charm before you can say wahoo. If you have a Seth, treat him as your king as he is the most hilarious, caring, selfless being alive on this planet today, and every moment with this ray of sunshine should be cherished. If you have lost a Seth, miss him with all your heart because he is a once in a lifetime. But remember his carefree laugh and billion dollar smile, and the way his eyes crinkle and light up when he does, and you'll fall in love again and again. Yep Seths steal your heart for good", "x": 11.321489334106445, "y": 16.859268188476562}, {"term": "Trevor", "definition": "Trevor's are downright amazing. Good at everything, they rarely find a game or sport or task that is difficult for them. Supportive, loyal, funny, and kind. They choose their words carefully and are the sweetest and most gentle men. They are extremely good looking but don't know it. Bright grey-blue eyes, tall, lean, & muscular, they can complete any physical task asked of them. They are fantastic builders and fixers, and take their time to complete projects correctly. He'll fix your sink, make you laugh while doing it, then kiss you so lovingly it makes your legs weak. Big, strong hands you can melt into. They are loyal and patient boyfriends who turn into rugged, patient, playful husbands and are the best fathers. Don't ever cross a Trevor- chances are he'll forgive you, but he'll never forget what you did. It takes a lot for him to truly open up to you, and he usually only has a couple of close friends. He's friendly but cautious of new people. Loves babies and dogs, will tolerate cats. A natural protector, lover, caregiver, and friend. Has the best laugh and most genuine smile. Nothing about Trevor is fake. Difficult to get to the core of, but when you get there you'll never need another man. Overall, the best kind of man is a Trevor.", "x": 1.3527922630310059, "y": 53.03614044189453}, {"term": "Luke", "definition": "To create a Luke: start with a base of hysterically funny. Mix in equal parts of cute, charming, sexy and intelligent. Combine with integrity, thoughtfulness and confidence until a solid foundation forms. For flavour, add a dirty mind to the hysterically funny but balance it by increasing the charm to ‘almost irresistible' quantity. You should find the resulting mixture is well formed and appealing to the eye. Add maturity, cheekiness and something ‘indescribably unique' to serve.  Summary: A Luke is one of the most amazing and unique people you will ever meet. In many ways he is like a great recipe for a person – containing all the right elements in just the right quantities. If you meet a Luke, show him he's special by hiding things to make him smile wherever and whenever you can – even on the internet.  If you ever have the opportunity to be friends with a Luke then take it. You will be the 2nd luckiest woman in the world.", "x": 23.028554916381836, "y": 24.846622467041016}, {"term": "Devin", "definition": "A name given to a man that will always have your back. He is kind, understanding, generous, strong, loving, reliable, funny, handsome, considerate, and hardworking. He is easy to fall in love with, and a complete sweetheart. He will make you laugh when you need it most, and won't let you down.", "x": -11.996386528015137, "y": 20.55337905883789}, {"term": "Mark", "definition": "He's the definition of amazing. He defines the word friend, too. He'll always be there for you. He defines hard working, someone who will go the distance for the one he loves even if he has to take baby steps first. Mark is someone who is handsome, but defines beauty not in what he says or does, but in what he is. He is someone who will never give up on something he wants, even if it's so far out of reach. He defines love, someone who will melt your heart and cause you to fall in love every time you see him smile, every time he says your name.. Mark is someone who'll stand by your side, and will be there when the smoke clears. He defines the words thoughtful, sweetheart, caring, &romantic. Someone who'll make you laugh until you cry with all his crazy antics. He is someone you can be yourself around, even when you barely know who you are. Mark will most likely be the reason you're living, the one who pulled you out of the water just before your head goes under. Someone who will sit and hold you because you're afraid of thunder. Mark is the definition of perfect; \"Having all the required or desirable elements, qualities, or characteristics; as good as it is possible to be\" Even though he won't say he agrees. Everyone knows that it's true. <3", "x": -15.461986541748047, "y": 16.325159072875977}, {"term": "Jesus", "definition": "Jesus will be the best person you will ever meet. He loves to talk to anyone who is feeling down and will comfort you when you need it. If you see one tell them they are the best person ever. He will always love you no matter what. If you date one. He will never cheat on you. Even though some of you disagree. He loves to talk to anyone. Always loves to meet people. Also, he is very smart in math. He loves people who are very generous. He hates people who always think who is always right. He thinks that every girl is beautiful no matter how ugly you look.", "x": 22.918519973754883, "y": -4.4415483474731445}, {"term": "Mason", "definition": "One of the sweetest, kindest, funniest guys. He stands up for his girl, but he's shy around most other girls. He's honest, and the \"No guy will pass my inspection\" kind of big brother. He's the kind of guy that though he's really sweet, most people would never know it.\r He loves music and video games, and he'd prefer sleeping in all day than going to school.\r He doesn't like big crowds or overly-loud people.\r He cares about his girlfriend's friends, even if he doesn't like them and if you insult his girl, you're going down.\r He likes his hair, too.\r He introduces his girlfriend to the girls he likes, but he makes sure she knows that he's loyal to one girl only.\r He has his ideal image of the perfect woman, but insists his girl is beautiful, and has an amazing personality.", "x": 1.459121584892273, "y": -6.753401756286621}, {"term": "Ian", "definition": "Ians are generally very intelligent, mentally gifted people. They can think on a much higher level than the average person. Ians are silly, quiet guys. They can be very funny when they talk. They only talk when they feel that its needed, and only if they think its worth spending the time saying it. An easy going guy, doesn't take much to make him happy and he laughs at almost everything. A pacifist, fairly easy to pick on but if he takes it personally he will retaliate strongly. A very determined individual, he will set high goals and make sure he achieves them. Ians try to become friends with everybody, he doesn't like having enemies. He doesn't like picking sides among peer disputes. Ians don't mind awkward silences if you are with them, even if you aren't talking with him and it is quiet, don't take it uncomfortably", "x": 5.860874176025391, "y": 47.52976989746094}, {"term": "Angel", "definition": "A beautiful woman with a heart of pure gold and passion. Able to warm your heart, love, cater and charm you. A protective soul with an urgency to watch over what is hers. A very understanding, powerful, yet gentle human being. A rare gem. If you got yourself an Angel, don't let go of her. Chances are you'll never find another one like her.", "x": 5.466735363006592, "y": -40.15095520019531}, {"term": "Bryan", "definition": "A nice, polite, genuine, caring, heart warming, understanding amazing guy who listens to everyones problems. He would do anything to make sure you don't hurt yourself. He puts others happiness before his own. He is the best person anyone could meet and anyone would be lucky to have him in their lives.", "x": -42.61808776855469, "y": -16.00116729736328}, {"term": "Cole", "definition": "Cole. He is an amazing person. He may come off as a shy or weird guy, but once you talk to him a little more then he might be the best person you'll ever meet. He has a vague sense of humor, but you'll learn to read it and laugh along too. Cole is a sentimental and understanding person. He makes you feel better or happier when you need it. He cares about his looks and will make sure his hair looks good before he takes a picture or goes to school. He listens to everything you have to say. He tends to get judged a lot which is understandable in this generation but, you shouldn't judge him. If you do him wrong he won't think much of you anymore. Never give a guy like Cole up.", "x": 15.476615905761719, "y": 23.87491798400879}, {"term": "Chase", "definition": "He is a great guy. He loves sports. He is handsome,and totally hot. He is an all around great guy. He may read your messages and not reply but just know he is helping other people and don't get worried he will come back to you. He makes everyone smile. He is a very happy person to be around.", "x": 14.568028450012207, "y": 6.457386016845703}, {"term": "Dakota", "definition": "The girl that is always there for you no matter what. Is good at making friends. Sometimes has a attitude but when you get to know her she will be the greatest friend you ever knew. Pretty. Has beautiful eyes. Loves everyone. Will never let you down. Will protect you like you were her family.", "x": -10.885112762451172, "y": -29.344627380371094}, {"term": "Garrett", "definition": "Garrett is the probably the most kindest guy you will ever meet, but he could be a pain in the ass. He has a great sense of humor, and is very fun to be around. Garrett is also very creative, and can be dirty minded some times. Garrett is a great friend and boyfriend he is there for you no matter what. He makes you smile even if you don't want to. He has a great personality and he smile all the time. Garrett is probably the best boyfriend ever. If you are his girlfriend you are very lucky because Garrett will be there for you no matter what, and if you are his one true love he will stick with you no matter how tempting these other girls might be. Garrett has the greatest smile ever, and has the most beautiful baby blue eyes. Garrett is probably one of the best friend and boyfriend anyone could ask for. Garrett is the most kindest person you could ever meet, but he could be a pain in the ass some time.", "x": 9.308588981628418, "y": 37.747947692871094}, {"term": "Adrian", "definition": "Adrian is the most amazing person you will ever meet. He will make you smile even if you have had a hella hard day.\r He will always have your back no matter what. All the girls like him and you will be very lucky to be his friend. He will do anything to keep a relationship and will kick someones ass if you mess with him or his friends. Loyal, smart, funny, and kind. An Adrian is about everything you can ask for. He also has hot - ass hair!!", "x": 7.1967668533325195, "y": 37.45489501953125}, {"term": "Antonio", "definition": "Antonio also referred to as Tony is the most amazingly extraordinary person you will ever come across if your even lucky enough to meet one. Tony is super outgoing but can be shy at times once you get to know him he'll make you laugh til you cry. Antonio is the greatest most best friend anyone could ever ask for, He will be your shoulder to cry, never leave you hanging, and will be there for you no matter what. He will treat the girl he loves like a Princess and if you happen to be the one he falls for let me just say you are single handily the luckiest Girl in the universe. You will fall in love with his overwhelming and heart-stopping personality There's no argument about it. His Beautiful Brown eyes are breathtaking.. will make the earth stop spinning you'll get lost in them, The truth is you'll be able to stare into them for an eternity. If you ever have the chance to say hi or befriend an Antonio don't blow it.. Because he truly is stunningly perfect.. His Charm will put you under a Spell.. He'll Change your Life, Forever", "x": 0.5649778246879578, "y": 26.91142463684082}, {"term": "Jeremy", "definition": "Jeremy is one of the most sarcastic people you'll ever meet. He's sensitive at times and a total dick at others. You'll never know how he feels toward you. He's impossible to figure out and it will drive you crazy. He's hilarious without trying and doesn't know it. But he's a good guy so you better hold on to him. He'll come around eventually", "x": -14.784320831298828, "y": 46.3527717590332}, {"term": "Jesse", "definition": "a super amazing guy. he's sweet, funny, caring, cute/hot, lovable, playful, and a bit of a trouble-maker. he has pretty eyes, he loves anime and music, and he says some of the sweetest things in the world. he's unique. he always knows how to make you smile or laugh, and can definitely cheer you up when your down. he's very trust-worthy, and you can tell him anything. yes, he's some-what perverted and says perverted things sometimes, but only says it to make people laugh. alot of girls like him, but he's not the type of guy that goes and dates every girl he can get. you should feel special if you get close to him, because he doesn't let many people get that close to him. jesse is just awesome. <3", "x": 21.40023422241211, "y": 22.604345321655273}, {"term": "Jackson", "definition": "A guy that's like crazy perfect. He's tall and strong and will love his girlfriend unconditionally, no matter how crazy she is. Jacksons are usually really athletic, and modest about it too. The Jackson you know will be cute and will end up to be your whole life. Your fights will start as \"you love me more\" to \"I love you to the moon and back, there's no way you love me more than I love you.\"  He'll put up with you and say he does it because he loves it. Or because it's his job, then tell you he loves his job. Jacksons are extremely modest, but strong in the emotionally, the mentally, and physically.You won't be able to get your Jackson out of your head. I promise you.  Overall, Jacksons are the best thing in the world. You won't go wrong if you find yourself one.", "x": -0.3032575845718384, "y": 16.483196258544922}, {"term": "Blake", "definition": "Originated from Old English, he is a virile alpha type with dark or light complexion. Strategic and visionary in his thoughts, his mind is always working to improve systems or himself. He is professional and focused with his work, and balances stressors with hobbies or through sexy time with his better half. He values intelligence and efficiency, seeks knowledge, and appreciates logic, thinks outside the box, and enjoys mental stimulation, wordplay, patterns with numbers, and problem solving. He typically works under the radar in stealth mode, quiet and focused. Like an iceberg, what you see is only a fraction of what is actually there. Results of his efforts surface with great magnitude, surprises those who underestimate his power and influence. Blake is wholehearted with his passions and the people he loves. He is well respected for his intelligence by all and loved by those who have the privilege to know him.", "x": 24.316781997680664, "y": 27.1748046875}, {"term": "Dalton", "definition": "A guy that will love you better than anyone could. Stubborn to admit love but if he does take the entry. Will deeply love his girlfriends and cares for his family way more than he will ever admit. If you are lucky enough to get or find a Dalton do what you can to get him because if he isn't appoached he won't do it himself. Seams seperated from the earth but more down to the earth then most people. Tall, Strong and incredibly intelligent he is the perfect guy. Good friend, Great Lover and even Better Person.", "x": -0.7395775318145752, "y": 10.423958778381348}, {"term": "Stephen", "definition": "Stephen will drive you wild, he is the most caring, loving, deep, devoted boyfriend in the entire universe. I love him to death. Stephens like to know they are cared for, so make sure you tell them how special they are to you as much as you can. Stephens are the kind of people who could come into your life in two seconds and leave a mark. People may tell you how to feel about him, but never listen. Nothing is worth losing him. Stephens tend to dwell in the past a lot. They feel like the past is just as important as today, so try not to make mistakes that hurt him. Stephens are very blunt, they tell you how it is, and how it is going to be. Sometimes you want to strangle him, but it isn't possible to be mad for too long. Always be there for him, no matter what, he loves memories. He is the biggest sweetheart you will ever meet, never let Stephen go. Never doubt him, or yourself. He hates to be doubted, he will pour his heart out to you, and do whatever it takes to make you change your mind. He has the most beautiful brown eyes in the world, and they make you melt every single time you look into them. He is truly perfect, he's so smart. He has the best personality a boy could have, and he loves music. Sometimes you feel like he's too good for you, and he thinks you're too good for him. In my case, he's too good for me. All the girls love Stephen, but who could blame them? Just don't let your jealousy take control of your actions, because he loves you, and only you.", "x": -2.5664095878601074, "y": 29.168704986572266}, {"term": "Tanner", "definition": "A Tanner is a man of great magnitude, comparable to the gods themselves. He never ceases to amazing those around him. If there was a book written about his life, it would be split into two sections; before you read his book and after, it's that life changing. If that book were to go to audio tape, Morgan Freeman would be required to be the narrator. On a scale of one to ten, he is easily a certified twenty. P Diddy wakes up feeling like him. I assure you he is extremely better looking than Mick Jagger, yet he never gets kicked to the curb. Oh, and his moves are far more superior. He has to keep a fence around his house at all times, because no matter what he is making in the kitchen, people all around try to get in his yard, and trust me, it is better than yours. He has a ranch full of baby panda bears, ligers, and humpback whales that he is teaching to perform Hamlet. His intelligence surpasses that of Socrates, Einstein, and Steven Hawking combined. His writing is as elegant as Shakespeare, but as pleasing as Dr. Seuss. If given the choice between eternal happiness and a Krispy Kreme doughnut, he'd take the doughnut because it's something he doesn't already have. If his life were a movie, Spielberg, Bay, and Lucas would all direct it. He is often called Superman. Not because he is super humanly strong (though he is very strong) or can fly, but because Kryptonite is his only weakness. If there were one word to describe Tanner, it would be ‘Scrumtrulescent'.", "x": -6.685758113861084, "y": 51.463401794433594}, {"term": "Alejandro", "definition": "A person who is perceived to be stubborn or cocky. You will at first resent him , and believe he is an incubus. When you truly get to know him , you'll find out he's the most amazing , sweetest loving person you'll ever know. You'll fall in love with his smile and adorable laugh. Your heart will soon belong to Alejandro.", "x": 6.620556354522705, "y": 18.265745162963867}, {"term": "Kenneth", "definition": "One of the most amazing guy's you could ever possibly meet... He will really turn your world around. Make you forget all the things you don't want to remember. Make you feel as if you're the only two in the world when you're with him. Kenneth is a guy you can always trust, no matter what. He will always know exactly what to say to make your heart race and make it beat faster and slower at the same time :) Kenneth knows how to have fun and you'll never find yourself bored when youre around him. Pretty much you will fall in love with him the day you look into his Gorgeoussss eyes. Kenneth is a wonderful addition to anyones life and it would be wrong not to meet one because NO joke... Kenneth is the most amazing,sweet and one of the funniest guys you will ever meet :)", "x": -2.196260690689087, "y": 32.3131217956543}, {"term": "Lucas", "definition": "An extremely handsome man, very intelligent, with an impeccable personality. He's truly a very special guy and once you get to know him, he'll cease to amaze you each day with his rare brilliant heart. Incredibly handsome, sensual, talented and has a deep interest in the universe which'll inspire you to learn too. He'll change your world to make it better. He's always there to lend you strength , hope during hardship. He might not think he's worthy of the world, but truth to be told, he deserves much more, he deserves the universe. An uber funny guy, he will make you laugh with his addictive humour. He loves music and receives peace from lyrics and melodies. His love's incredible. He may not show it, but he is a super loving and passionate person. He may appear withdrawn, but you must take time to know him because he will make your life a better place. His love is heartfelt and sincere, that no amount can feel too much. He will stun you with how much he cares. He's the man you can't imagine life without. He's person you'll spend your days thinking about, wanting to speak to, care for, be there for. He's been through so much yet has a fighting spirit. You will adore, admire and love him. He should never be hurt or upset only protected. You'll want to be there for him through thick and thin no matter what.. A man like this will make you feel like you've never felt before. You'll want to be everything he desires so you can always see him happy some more", "x": 29.750293731689453, "y": 25.824331283569336}, {"term": "Miguel", "definition": "Tall, gorgeous, smart and sensitive guy. The most amazing person on Earth. Into dogs, sports and music. Will permanently change the life of anyone that gets to know him. There is no other person as loveable as he is. Once you get to spend some time with him you will no longer be able to forget him. The person who he choses to love is one very lucky girl.", "x": 26.493896484375, "y": 18.49039649963379}, {"term": "Spencer", "definition": "n. A Spencer is a guy you'd love to have as a boyfriend. He is sweet, loyal, and respectful. He's not afraid to be himself and he encourages you to break out of your shell when you're with him, too. He's a guy that you immediately are interested in, just with looks, they make you wonder and want to start talking to him. The minute you start talking to him you're glad you did, he's everything that anyone could ever want. He's fun and outgoing, yet so sweet and nice and cute towards his girlfriend. His girlfriend will get every other girl jealous and want a Spencer for themselves. He's a heart-breaker, that's for sure, but when he's dedicated to you he's all in for you. He'd do anything. He is truly amazing, and his looks are just a bonus. Holding hands with him & making long eye contact with him will give you butterflies for days. Kissing will give you probably the best feeling you could ever imagine, or better. Plus he is a pretty great kisser, just a bonus;)\r But, his hugs are warm and comforting, he is honestly the best thing a girl could ask for to enter into her life.", "x": 25.293081283569336, "y": 9.728548049926758}, {"term": "Bryce", "definition": "An absolutely amazing guy. Someone who flirts like crazy, but is sensitive. Someone who may not act like they care at times, but loves you more than you could ever imagine. He's a bit shy once you get to know him, even though on the outside he sets a player image. Doesn't cheat, and he makes sure you know that. He's good-looking, sweet, and lovable. If you ever are lucky enough to be with a Bryce, never ever let him go. You'll regret it for the rest of your life.", "x": 1.8023760318756104, "y": 9.368635177612305}, {"term": "Paul", "definition": "The kindest, best guy friend you could ever have. Unknowingly funny and always willing to listen. He always has a smile for you when you see him and you find yourself missing him if you don't see him for a while. He might seem shy at first but once you get to know him he begins to open up and let you in, you cannot imagine how lucky this makes you feel. Great soccer player too!! Any girl would be lucky to have him.", "x": 12.357010841369629, "y": 8.607229232788086}, {"term": "Victor", "definition": "Victor is...well...amazing. He is insanely cute but is mega hot at the same time.  His smile will light up your day. He never fails to make you smile or blush like a idiot. You will lost in his deep brown eyes (I know I have). His laugh is literally the cutest and most contagious thing ever.  He is insecure at times but will never fail to shower you with compliments.  He is one smooth mother fucker when it comes to sweet talking. He is surprisingly flirty and very good at it. He can make any girl fall head over heels for him in a matter of seconds with one swoop of his hair.  He is insanely sexy. He doesn't need to do much to turn you on. He is a freak in the bed. Do it once with him and your addicted.  He is a amazing friend. He is caring, understanding, and will do anything to make you feel better. You feel as if you can tell him anything. He is funny, spontaneous, a goofball and quirky at times (but it's adorable). You can do anything with him and have no judgement, cause most likely he's done the same thing.  He has been through some rough times and has flaws but it able to work through them. He is able to help you with anything and be there for you through thick and thin.  In conclusion, I can't even put into words how amazing victor is. I love you bb.", "x": 19.94761848449707, "y": 20.331573486328125}, {"term": "Brendan", "definition": "Awesome guy\r Great friend\r Very loyal\r Amazing hair\r Every guy wishes he could be like him and be his friend\r All the girls love him\r Great cuddler\r fun loving guy at times\r Good at sports but not an arrogant jock\r Not conceited  Gorgeous\r Is nice to everyone\r Funny and can make you smile by being himself\r Party animal at times\r Can be cold but is eventually nice again\r Very smart\r Loves reading  Best boyfriend\r Loves animals\r Athletic", "x": 16.01756477355957, "y": 5.632659435272217}, {"term": "Jake", "definition": "Jake is a very fun and outgoing guy. He has a smile that will brighten anyone's day and eye's that alway's have the girl's looking twice. He is a kind, sweet, trustworthy, cute, caring, smart, loving person that will alway's be there for you. But dont take his kindness and sweetness as a weakness, if you ever dare too touch his girl or anyone in his family, he would be the first guy too beat a fool up.\r Jake has alot of female friends, but his girl alway's come before them. If you ever get the chance too be with a Jake, take it and never let him go. Cause if you do youll regret it for the rest of your life.", "x": -12.783211708068848, "y": 43.18453598022461}, {"term": "Marcus", "definition": "Marcus. Amazing boy that will steal your heart. Loving. Caring. Puts you first. A smile to die for. Will melt you with one look. Stop at nothing for your heart. Know what he wants and won't stop at nothing. Has a dark side that you have to break through. When your not with him it's hard. And every time you hear his name. You melt and tingle and your muscles tenses.", "x": -15.739041328430176, "y": 14.356663703918457}, {"term": "Tristan", "definition": "Tristan is a loyal guy who will be there for you until the end. He is outgoing and fun on the outside but he holds secrets and insecurities on the inside. If you find a friend in him then he will be a great person or boyfriend to have. Tristan has a great sense of humour.", "x": -9.006009101867676, "y": 19.623598098754883}, {"term": "Jeffrey", "definition": "The sweetest guy you'll ever meet. Even when he's having his own problems, he'll try to solve yours. He's funny and knows how to cheer anyone up. He'll do whatever he can to help and you can always count on him for whatever is going on in your life. He is an amazing guy and you're lucky if you ever meet him. He also pulls off sweater vest and cardigans.", "x": -12.55671501159668, "y": 22.93647575378418}]
