[
  {
    "term": "♒ Aquarius",
    "definition": "Some of the best people in the world will have the Aquarius Zodiac sign. They can kiss the best and are very kind. They are very loyal and have the best eyes. If you have a relationship with an Aquarius, they're a keeper. Love those who are an Aquarius.",
    "x": 5.310528755187988,
    "y": 171.04965209960938
  },
  {
    "term": "♓ Pisces",
    "definition": "The most emotional, yet reasonable of all 12 zodiac signs. Pisces have some of the most abstract and spiritual dreams which greatly reflects on their unique personalities and makes them stand out from the rest of the signs. However they can be easily misled, weak willed and escapist. They live idealistically but can be very hopeful and faithful. Their emotions play an major role on their decision making, which is usually why things only get worse when Pisces are going through tough times. However do not be fooled by their weaknesses for they are excessively intuitive and observant. A smart Pisces can catch a liar in a heartbeat, which makes them great detectives and lawyers. Their emotions are the most valuable to them and they will do what ever it takes to avoid emotional pain. Just like porcupines have needles to protect them from being eaten, Pisces has a heightened sense for catching a liar or fake before you can hurt their feelings or lead them on. If you are in love with a Pisces you will have to stay faithful and remain caring, in return they will do the same. Hook up with someone else while your with them and they will drastically lose interest, especially if its sexual. This is because you distorted their dream of a perfect place with your carelessness, and this dream is now a nightmare. Treat them right and they will love you deeply, they will always make sure your living healthy and happy, and will always come to you for their emotional and physical needs.",
    "x": 136.30465698242188,
    "y": 23.800941467285156
  },
  {
    "term": "♈ Aries",
    "definition": "The moment you come across an Aries, the first thing that comes to your mind is his/her friendly nature. People having an Aries profile cannot tolerate injustice, always fight against it and will defend the weak. The innocence of Aries people is enough to cover their, sometimes, aggressive behavior. This naiveté brings fearlessness, while at the same time making them highly vulnerable. They trust people easily, get hurt in the process, forgive and forget, and then, trust again. An Aries person is beyond shrewdness, fallacy and lies. Aries are pretty impatient, but liberal with money and material things. Aries may get extremely angry in a minute, but the anger seldom lasts for a long time. Aries people never nurse a grudge and completely forgive and forget. They will never let you know that they are hurt. For Aries, people are either black or white, without any shades of grey. Aries usually stick to their opinion and won't listen to anything they do not believe. They have a contemplative side to their personality. The simplicity is blended with the blind passion of a born crusader. Aries is mentally strong and always one of the pioneers.",
    "x": 101.1905517578125,
    "y": -84.98519134521484
  },
  {
    "term": "♉ Taurus",
    "definition": "Agressive. Loves being in long relationships. Likes to give a good fight for what they want. Extremely out going. Loves to help people in a time of need. Good kisser. Good personality. Stubborn. A caring person. One of a kind. Not one to mess with. Are the most attractive people on earth!",
    "x": -106.82486724853516,
    "y": 148.84173583984375
  },
  {
    "term": "♊ Gemini",
    "definition": "Gemini is a sign that runs from May 21st to June 20th. Geminis are Creative, artistic, Nice, Intellectual, Individualistic, Outgoing and Compassionate. On the other hand they can also be inconsistent, nervous, nosy and lazy at times.",
    "x": -44.365760803222656,
    "y": 78.63272094726562
  },
  {
    "term": "♋ Cancer",
    "definition": "The Cancer person is: fearless, tenacious, retentive, resourceful, self-contained, very defensive, family- and home-oriented, intuitive, honest, generous, humorous, traditional, perceptive, emotional, loving, shrewd, proud, sensitive, protective, nurturing, cautious, helpful, purposeful, wise, easily flattered, hard-working, romantic, imaginative, security-oriented, very sexual, nurturing, warm, sympathetic, patriotic, sentimental, caring, and extremely protective of loved ones, and very innocent. The Cancerian is prone to being changeable or moody, hyper-sensitivite, touchy, patriotic, clingy and unable to let go, tenacious, devious, dominating, secretive, coldness, madness, overcritical or harshness, blunt, ruthless, suspicious, jealous, quick-tempered, violent, volatile, controlling, depressive, deceitful, lacking in stability, manipulative, aloof, dogmatic, eccentric, boastful, reckless, over-dramatic and somewhat arrogant. Cancers can have problems coming out of their shell. THey're often times reffered to as the snail human.",
    "x": 43.884090423583984,
    "y": 73.4740219116211
  },
  {
    "term": "♌ Leo",
    "definition": "Leo is ruled by the Sun so the personality is charismatic, strong and is created to shine.They take on responsibility, naturally. Leos magnetic spirit and enthusiasm makes for success in any field but Leos require autonomy and some individual power over their work. Leo is Queen of the Zodiac. Her royal presence demands respect. Lions are like the Sun itself, warm and radiant, ready to help great and small, and give without counting the cost. No-one is kinder than a Lion, but can be badly hurt if people ignore or misunderstand them. If Leo is your Rising Sign, you're naturally cheerful, and walk out onto the world's stage with a smile on your face. People are drawn to you, heads turn, and ...let's be honest... you love it! You're neither proud nor pushy, but sometmes people see you like that. Like every other aspect of life, love is for Leos something mythical that should be experienced to the full. Love should be significant, daring, spectacular and dramatic. A little affection is not their style. They love to be in love and they love playing the role of lover. With Leos you’re in for a real love experience. Leos are perfect lovers. They have the talent to create from every love something special and magical. They give the impression that two people are in love for the first time every in the history of the world. They love stylishly and without reservation and loyalty is part of their nature. Although Leos are vain and love being admired by members of the opposite sex, they are reliable partners and have the idealistic idea that love should be something dependable. Excellent compatibility with Geminis for romantic relationships.",
    "x": 114.0939712524414,
    "y": 135.9330291748047
  },
  {
    "term": "♍ Virgo",
    "definition": "The Virgo is generally portrayed as a natural, steady being. The virgo is known for her absolute order, she is a rule unto herself. She bears supreme emotional strength, her greatest fear is that of seeming weak and helpless. Her power to speak her mind is often frowned upon by others. She doesn't judge, but observes. She is known for her creativity, she challenges herself artistically. She bears a root of sensuality that only a few are privileged to witness. She pays close attention to her mate and gives pleasure to his senses. She craves to feel enlightened by sensuality, but will never say. Her intelligence over rules her impulse. She is a deep thinker, but is infatuated with thought. She sees everything, but says nothing. She is the wittiest of woman. Her humour is her best trait and she uses it to her advantage. Her mannerisms are elegant, however, there is an awkward streak to this perfectionist. She is interested in people and longs to be seen as an object of interest. She observes freedom from a distance, never dares to meet its acquaintance.",
    "x": -119.72714233398438,
    "y": -72.07717895507812
  },
  {
    "term": "♎ Libra",
    "definition": "A Libra is somebody who is SEXY, FUN, and COOL. It is said that Librans should switch attitudes with Capricornians because their look matches them well. Libras look like they haven't a care in the world, but will most likely be the one to run in the burning building to save the trapped and left-behind. They LOVE the lucrative and luxurious! But that doesn't mean they won't give over recieving. Libras have these overwhelming personalities that sometimes lead others the wrong way. Some people don't like Libras because they seem full of themselves. Which they are, but that doesn't mean they don't care. Librans love people. They love to cheer others up. They can seem annoying, but just don't let them know that you think that. They'll want to hide and cry. They have NOTORIOUS voices. You'll most probably remember a Libra by their voice. Libras make good actors and actresses, writers, columnists, journalists, lawyers, etc.",
    "x": -49.51820755004883,
    "y": -9.617324829101562
  },
  {
    "term": "♏ Scorpio",
    "definition": "Scorpios are kinda scary and intimidating when you first meet them but they are actually kind and caring once you become their friend and one of the best friends you will ever have. Scorpios are not the people that you want to be enemies with, if you aren’t their friends Scorpios don’t have any problems being a bitch and will literally destroy you. Scorpios will stick with you through hard times and be by your side whenever they can. Scorpios like to hide their problems and pretend to be ok but a lot of the time they are upset about something, they will never worry you with their struggles unless they trust you a lot. That makes them seem really secretive and they are, Scorpios will always hide your secrets and they have many secrets of their own. Eyes and bone structure are Scorpios best features. They are the cutest and prettiest signs but they have no idea and they will always deny it no matter what- along with crushes they won’t say anything about them and will never admit it. They tend to flirt with people they like without knowing that they are. Scorpios are loyal, trustworthy, and sweet. If you are good friends with a Scorpio you are extremely lucky and they will always be your comforting friend. They hold grudges but when it comes to people they care about they can’t stay mad and no matter if a Scorpio is mad at you or they are resting or at an event they will always be there for you when you need them.",
    "x": -141.93873596191406,
    "y": 40.05521011352539
  },
  {
    "term": "♐ Sagittarius",
    "definition": "Sagittarians are described as being good natured, honest, enthusiastic, highly intelligent, idealistic, and humorous. Their personalities are a mixture of outgoing confidence with a laid back appeal, which makes for a friendly disposition. They have a great sense of the world at large, whether it be current events, fashion, music, or art. They have a free-wheeling spirit and hate to be tied down to responsibilities. This enables them to either travel or take on intellectual pursuits. They usually sum up situations with a broad brush, because of this, they are able to look outside of the box for most situations and give a philosophical opinion. They are HUGE risk takers and are attracted to extreme sports. When in love, they are very enthusiastic and over the top. Because of their can do attitude, they are happy to take on task and are loyal and responsible.",
    "x": 38.731544494628906,
    "y": -14.776019096374512
  },
  {
    "term": "♑ Capricorn",
    "definition": "Energetic, patient, responsible, hardworking, and trustworthy. Capricorns are someone you want as a friend and a romantic partner! Their kind, and sympathetic nature, make them great friends. Capricorns will be glad to help out, and they expect nothing in return for their good deeds! Capricorns are passionate partners, and like to take control in romance, so they don't feel vulnerable to the other person. Capricorns are hardworking and like to plan, so that they get everything just right. But Capricorns don't trust others to finish details off their work, so they tend to work by themselves. A Capricorns weakness consists pf greed, possessiveness, and being unimaginative. Its hard to connect to them emotionally, because they will form very strong and emotional bonds with anyone they let in. Capricorns are self disciplined and can be stubborn. Pessimism and depression can creep in if the succumb to mood swings, so its important to be careful with them. And they take things seriously and sometimes literally, so choose your word choices carefully as well.",
    "x": -10.944339752197266,
    "y": -107.19334411621094
  }
]
